[
  {
    "name": "Josh Allen",
    "position": "QB",
    "auctionPrice": 11,
    "totalPoints": 418.0,
    "average": 26.125,
    "bio": "Allen is the perfect example of why rushing is so important when it comes to QB fantasy evaluations. The 2018 first-round pick finished as fantasy's No. 6 QB last season despite ranking 23rd in passing yards, 21st with only 20 passing TDs, third worst in completion percentage (59%) and 11th worst in YPA (6.7). Of course, Allen also produced a 109-510-9 rushing line and has now paced the position in rushing TDs in each of his two NFL seasons (17 total). Allen's passing troubles remain a red flag, but the addition of Stefon Diggs should help his cause. As long as he keeps running, Allen will be a back-end QB1 option.",
    "otherLeagueDraftValue": 8.93
  },
  {
    "name": "Patrick Mahomes",
    "position": "QB",
    "auctionPrice": 61,
    "totalPoints": 399.0,
    "average": 26.6,
    "bio": "Patrick Mahomes is 24 years old and has 36 NFL starts under his belt yet has already been named both league and Super Bowl MVP. So where does he go from here? Well, considering he still has Andy Reid's pass-heavy scheme, a strong offensive line and a terrific group of targets led by Tyreek Hill and Travis Kelce at his disposal, we should probably expect more of the same. Granted, Mahomes returned to earth a bit last season (4,031 passing yards, 28 total TDs) after his breakout 2018 campaign (5,097 yards, 52 TDs), but he was still unquestionably one of the best players in the league. Mahomes was fantasy's No. 3 scoring QB during the 13 weeks he played in full, and that doesn't even count his 12 touchdowns in three playoff games. Mahomes remains an elite fantasy option.",
    "otherLeagueDraftValue": 30.75
  },
  {
    "name": "Aaron Rodgers",
    "position": "QB",
    "auctionPrice": 15,
    "totalPoints": 394.0,
    "average": 24.625,
    "bio": "Once a perennial top-two fantasy QB, Rodgers has settled in as more of a mid-to-back-end QB1 in recent seasons. That included 2019, which saw him finish ninth in fantasy points even though he appeared in all 16 games and ranked eighth in pass attempts. Rodgers' efficiency has been a culprit, as he hasn't finished better than 16th in YPA since 2014 after previously dominating the category. He also hasn't cleared 26 pass TDs in a season since 2016 and is no longer much of a factor with his legs. Rodgers has Davante Adams, Aaron Jones and a solid line at his disposal, but the 36-year-old is no longer an elite fantasy weapon.",
    "otherLeagueDraftValue": 5.36
  },
  {
    "name": "Deshaun Watson",
    "position": "QB",
    "auctionPrice": 24,
    "totalPoints": 389.0,
    "average": 24.3125,
    "bio": "Watson enters his fourth NFL season fresh off back-to-back fourth-place finishes in fantasy. The 24-year-old has emerged as one of the game's best players, ranking no lower than eighth in completion percentage and 13th in yards per attempt in each of the past two seasons. Watson has yet to clear 26 passing touchdowns in a season, but he makes up a ton of ground with his legs, ranking top-four in rushing attempts, yards and touchdowns in each of the past two seasons. The elephant in the room is the loss of top weapon DeAndre Hopkins, though it's worth noting that Watson has averaged a strong 9.2 YPA to wide receivers other than Hopkins in his career. Watson remains a solid fantasy starter.",
    "otherLeagueDraftValue": 2.66
  },
  {
    "name": "Kyler Murray",
    "position": "QB",
    "auctionPrice": 30,
    "totalPoints": 387.0,
    "average": 24.1875,
    "bio": "Murray's rookie season had its ups and downs, which is exactly what you'd expect from a first-year starting quarterback. The 2019 first overall pick struggled to 6.9 YPA and took a league-high 48 sacks, but he also finished strong by leading the Arizona offense to three-plus touchdowns in eight of the team's final 11 games. Murray's rushing ability helped him to a 93-544-4 rushing line (top-four in all three categories) and an eighth-place finish in fantasy points. Murray was already a strong bet for a second-year leap, but the addition of DeAndre Hopkins further adds to his appeal. The hype might lead to an irresponsible ADP, but there's little doubt Murray has elite upside. He's a solid fantasy starter.",
    "otherLeagueDraftValue": 16.48
  },
  {
    "name": "Russell Wilson",
    "position": "QB",
    "auctionPrice": 42,
    "totalPoints": 367.0,
    "average": 22.9375,
    "bio": "The 2019 season was a tale of two halves for Wilson. He was the top-scoring fantasy QB through Week 6 but was held to three top-12 weeks and the 11th-most points the rest of the season. At the end of the day, he had his eighth top-11 fantasy campaign in as many tries, which includes four top-three seasons since 2014. Wilson remains a force with his legs (he's ranked no lower than ninth among QBs in rushing yards in his career), but he's also ranked top-three in passing touchdowns (33.3 per season) in each of the past three seasons. With Tyler Lockett, second-year receiver DK Metcalf and newcomer Greg Olsen at his disposal, the 31-year-old Wilson remains a solid QB1.",
    "otherLeagueDraftValue": 26.52
  },
  {
    "name": "Tom Brady",
    "position": "QB",
    "auctionPrice": 25,
    "totalPoints": 351.0,
    "average": 21.9375,
    "bio": "In case you were living under a rock during the offseason, Tom Brady is now on the Buccaneers. The 43-year-old hasn't been much of a fantasy force in recent seasons, having finished 12th or worse among QBs in fantasy points in three of the past four seasons and four of the past seven. He's also coming off arguably his worst professional season (24 pass TDs, 61% completion rate, 6.6 YPA). Of course, there's plenty of reason to expect a bounce-back in Tampa, as his top targets go from Julian Edelman, James White and Mohamed Sanu to Mike Evans, Chris Godwin and old friend Rob Gronkowski. Brady adds very little with his legs but avoids turnovers and figures to push the ball downfield more in Bruce Arians' high-volume, pass-first attack. Consider the GOAT a back-end QB1.",
    "otherLeagueDraftValue": 2.27
  },
  {
    "name": "Justin Herbert",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 349.0,
    "average": 23.266666666666666,
    "bio": "The Chargers found their heir to Philip Rivers when they selected Herbert with the sixth pick of April's draft. Herbert is one of the biggest quarterbacks in this year's rookie class, at 6-foot-6, 236 pounds. Herbert, who has drawn comparisons to Ryan Tannehill and Carson Wentz, figures to add some slight value with his legs. He'll enter his first training camp behind veteran Tyrod Taylor, but it will be a surprise if he's not under center before midseason. Herbert will enjoy a decent supporting cast (Keenan Allen, Mike Williams, Hunter Henry, Austin Ekeler), but he is a long shot for rookie-season fantasy value and doesn't need to be drafted in most formats.",
    "otherLeagueDraftValue": 2.76
  },
  {
    "name": "Ryan Tannehill",
    "position": "QB",
    "auctionPrice": 8,
    "totalPoints": 342.0,
    "average": 21.375,
    "bio": "Tannehill signed a four-year extension with Tennessee following an impressive bounce-back 2019 campaign in which he completed 70% of his passes (third best) and posted 9.6 YPA (first). Tennessee scored three-plus touchdowns in 12 of Tannehill's 13 starts, which helped the 31-year-old to the third-most fantasy points among quarterbacks from Week 7 on. Tannehill has been around since 2012, but he has finished only one season as a top-15 fantasy QB and is a strong bet for statistical regression to the mean. With the Titans' extremely run-heavy offense also in mind, the veteran passer is best viewed as a solid QB2.",
    "otherLeagueDraftValue": 0.79
  },
  {
    "name": "Lamar Jackson",
    "position": "QB",
    "auctionPrice": 53,
    "totalPoints": 337.0,
    "average": 22.466666666666665,
    "bio": "The 2019 NFL MVP is fresh off a breakout season in which he outscored the next-closest quarterback by 78 fantasy points despite resting in Week 17. The dual-threat weapon threw 36 touchdowns to only six interceptions while adding a record-setting 176-1,206-7 rushing line -- that rushing production alone would've ranked 28th among running backs. The question is: Can he do it again? History says no, as his 9.0% TD rate (highest the NFL has seen over the past decade) is unsustainable, and the last quarterback to repeat as the top-scoring fantasy QB was Daunte Culpepper in 2004. On the other hand, Jackson's rushing volume and prowess give him an extremely high floor, as shown by his 11 top-six fantasy weeks in 15 outings last season. Jackson's unique style makes him an elite fantasy weapon and worth a look early in Round 3.",
    "otherLeagueDraftValue": 8.25
  },
  {
    "name": "Kirk Cousins",
    "position": "QB",
    "auctionPrice": 9,
    "totalPoints": 317.0,
    "average": 19.8125,
    "bio": "Cousins may be conservative, but there's no denying he was one of the league's most effective passers last season. The eight-year vet completed 69% of his passes (top-5 for the second consecutive season) and posted an 8.1 YPA (seventh best). Despite the efficiency, Cousins was not a good fantasy QB. Minnesota's run-heavy offense was problematic, as he posted one weekly finish better than sixth and was outside the top 20 in eight of 15 starts. Cousins hasn't used his legs as often in Minnesota as he did in Washington, which has been a factor in his 12th-   and 15th-place finishes among QBs in fantasy during the past two seasons. Especially with Stefon Diggs gone, Cousins is a mid-to-back-end QB2.",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Matt Ryan",
    "position": "QB",
    "auctionPrice": 14,
    "totalPoints": 295.0,
    "average": 18.4375,
    "bio": "Ryan's bizarre roller-coaster career continued in 2019, as his 11th-place fantasy campaign means he has finished outside the top 10 QBs in fantasy points during odd years and no lower than seventh in even years, going all the way back to 2012. In Ryan's defense, he missed a game (his first since 2009) and still played well, ranking top-nine in completion percentage for the eighth consecutive season. Ryan also paced all QBs in completions (408) and finished top-six in passing yards for the 10th straight season. Operating in Dirk Koetter's high-volume offense with Julio Jones, Calvin Ridley, Todd Gurley and five first-round picks on the offensive line, Ryan has a high floor and is a fringe QB1.",
    "otherLeagueDraftValue": 0.44
  },
  {
    "name": "Derek Carr",
    "position": "QB",
    "auctionPrice": 1,
    "totalPoints": 293.0,
    "average": 18.3125,
    "bio": "Carr played better last season than you probably realize, but once again it didn't lead to much fantasy success. Granted, he was very conservative (6.6 aDOT), but Carr completed 70% of his passes (second highest) and posted a 7.9 YPA (ninth) all while dealing with 24 drops (third most). That efficiency helped him to only one top-10 fantasy week prior to a pair of eighth-place showings when it mattered the least during Weeks 16-17. Carr has never posted a top-10 fantasy campaign in six NFL seasons and has finished 16th or worse each of the past three seasons. The Raiders' offense simply hasn't scored enough to overcome Carr's conservatism and low-end rushing production. Rookie additions Henry Ruggs III, Lynn Bowden and Bryan Edwards will help, but Carr remains a fringe QB2.",
    "otherLeagueDraftValue": 0.18
  },
  {
    "name": "Ben Roethlisberger",
    "position": "QB",
    "auctionPrice": 10,
    "totalPoints": 275.0,
    "average": 18.333333333333332,
    "bio": "Roethlisberger is back in Pittsburgh after missing all but two games due to injury last season. The last time we saw Roethlisberger for a full season, the Steelers' offense set a franchise record with 51 touchdowns in 2018. Roethlisberger paced the NFL in dropbacks (712), attempts (675) and completions (452), while finishing top-five in passing yards (5,086), passing touchdowns (34) and fantasy points (342) that season. The 38-year-old finished eighth or better in fantasy points per game in five straight seasons prior to 2019. Roethlisberger adds little with his legs, but he has a good line, an intriguing WR trio led by JuJu Smith-Schuster, and newcomer TE Eric Ebron in the fold. Consider Big Ben a top-15 option with QB1 upside.",
    "otherLeagueDraftValue": 0.86
  },
  {
    "name": "Matthew Stafford",
    "position": "QB",
    "auctionPrice": 18,
    "totalPoints": 262.0,
    "average": 16.375,
    "bio": "Stafford missed half of the 2019 season due to injury, but don't let that overshadow what was otherwise a very strong campaign. The Lions' offense scored 21 touchdowns during his eight starts (2.6 per game; 1.8 per game in the other eight), and Stafford finished 62.5% (five of eight) of his starts as a top-10 fantasy QB, which was the position's fourth-best rate. Powered by a league-high 10.8 aDOT (average depth of target), Stafford's career-high 8.6 YPA was second best in the league. Prior to last season, the 32-year-old had not missed a game since 2010, and he is well-positioned behind a solid line and with Kenny Golladay, Marvin Jones Jr. and second-year TE T.J. Hockenson as his primary weapons. Consider Stafford a strong QB2.",
    "otherLeagueDraftValue": 0.72
  },
  {
    "name": "Jared Goff",
    "position": "QB",
    "auctionPrice": 2,
    "totalPoints": 255.0,
    "average": 17.0,
    "bio": "The Rams' offense took a step back last season, but heavy volume allowed Goff to make occasional noise in fantasy. Goff finished top-five in pass attempts, completions and yards, which helped him to seven top-10 fantasy weeks (fifth most). The 2016 first overall pick has finished 12th, seventh and 13th in fantasy points during Sean McVay's three seasons. He adds very little with his legs (40 rushing yards last season) but still manages to hang in as a streaming option thanks to McVay. In 2020, Goff will have a strong group of targets led by Robert Woods, Tyler Higbee and Cooper Kupp, though the Rams' line remains a concern. Consider Goff a midrange QB2.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Cam Newton",
    "position": "QB",
    "auctionPrice": 9,
    "totalPoints": 247.0,
    "average": 16.466666666666665,
    "bio": "Newton signed with the Patriots following nine seasons in Carolina. The dual-threat quarterback was playing some of the best ball of his career in 2018, but that campaign was cut short by a late-season shoulder injury and a foot injury derailed his 2019 campaign. Newton attempted only 89 passes and ran the ball five times in two games prior to being shut down for the season. Now that he's 31 years old, it's fair to wonder whether he can still be a factor with his legs and, if not, can he make up for it with his arm? Even missing two games in 2018, Newton finished  top five at the position in carries, rushing yards and rushing touchdowns for the eighth consecutive season, so it's very possible he has something left in the tank. He's worth a late-round flier, as he'll be back on the QB1 radar if he beats out Jarrett Stidham.",
    "otherLeagueDraftValue": 1.02
  },
  {
    "name": "Teddy Bridgewater",
    "position": "QB",
    "auctionPrice": 11,
    "totalPoints": 244.0,
    "average": 16.266666666666666,
    "bio": "Bridgewater will replace Cam Newton as Carolina's starter following a pair of seasons as Drew Brees' backup. Bridgewater has barely seen the field since 2015 but was forced into extended action in six games last season. He showed fairly well, tossing nine TDs to two INTs while completing 68% of his passes (sixth best). Bridgewater was very conservative ' his 6.1 aDOT was easily lowest in the league, but he still managed the 11th-most fantasy points during that span. Bridgewater will work with innovative rookie head coach Matt Rhule and has a decent group of weapons led by DJ Moore, Curtis Samuel, Robby Anderson and Christian McCaffrey. Bridgewater's conservative game and minimal rushing contributions (31 rushing yards last season) limit him to fringe QB2 territory.",
    "otherLeagueDraftValue": 0.05
  },
  {
    "name": "Philip Rivers",
    "position": "QB",
    "auctionPrice": 1,
    "totalPoints": 244.0,
    "average": 15.25,
    "bio": "Rivers is now the starter in Indianapolis, following 16 seasons with the Chargers. Rivers joins the Colts following a 2019 campaign in which he did some things well (66% C%, 7.8 YPA) but struggled elsewhere (20 INTs, 48.6 QBR). Rivers hasn't finished a season better than eighth in fantasy points since 2013 and has one top-10 during the span. He offers almost zero with his legs (34 yards and zero TDs the past three seasons). Relative to last season in LA, Rivers' primary targets in Indianapolis won't be quite as good, but his offensive line will be substantially better. Though Rivers is an upgrade for the Colts, he is still unlikely to provide consistent QB1 numbers. He's worth a look only in 2QB leagues.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Baker Mayfield",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 243.0,
    "average": 15.1875,
    "bio": "Mayfield was one of 2019's biggest busts, with preseason concerns related to interceptions, a lack of rushing production and shaky offensive tackles all proving problematic when push came to shove. The 2018 first overall pick appeared in all 16 of Cleveland's games and was 10th in pass attempts, but he managed only 25 total touchdowns to go along with 21 interceptions (second most), 40 sacks (seventh) and 141 rushing yards (20th). Mayfield was fantasy's No. 20 scoring QB and managed only two weekly finishes better than ninth. A supporting cast led by Odell Beckham, Jarvis Landry, Nick Chubb, Kareem Hunt and Austin Hooper is a positive, as is the arrival of new coach Kevin Stefanski. Mayfield is a fine post-hype sleeper but shouldn't be counted on as a starter just yet.",
    "otherLeagueDraftValue": 0.04
  },
  {
    "name": "Drew Brees",
    "position": "QB",
    "auctionPrice": 26,
    "totalPoints": 218.0,
    "average": 18.166666666666668,
    "bio": "Brees missed six games due to injury last season and also ceded occasional snaps to Taysom Hill. The future Hall of Famer was still fantasy's No. 2 scoring QB during the 10 weeks he was active, producing 28 touchdowns and only three interceptions. Brees continues to win with elite efficiency, having paced the NFL in completion percentage in each of the past three seasons while ranking no lower than 10th in YPA during that span. Brees' supporting cast is arguably better this season, with Emmanuel Sanders added to a group that includes Michael Thomas, Jared Cook, Alvin Kamara and a quality line. Now 41, Brees is a back-end QB1.",
    "otherLeagueDraftValue": 0.28
  },
  {
    "name": "Carson Wentz",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 190.0,
    "average": 15.833333333333334,
    "bio": "Despite his wide receiver room being absolutely ravaged by injuries, Wentz posted his second career top-10 fantasy campaign in 2019. Volume was the primary reason, as the 27-year-old ranked first in snaps, fifth in pass attempts and seventh in carries among QBs. Wentz dealt with 24 drops (third most) and got very little after the catch for the fourth consecutive season (4.8 RAC). Perhaps most important, Wentz held up, handling 99% of the Eagles' dropbacks before a concussion suffered in the playoffs. Wentz will work behind an elite offensive line and with a solid group of weapons in 2020. He's a back-end QB1.",
    "otherLeagueDraftValue": 0.14
  },
  {
    "name": "Joe Burrow",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 188.0,
    "average": 18.8,
    "bio": "The Bengals selected Burrow with the No. 1 pick of April's draft. Burrow doesn't have the strongest arm, but he is extremely accurate and has good size (6-foot-3, 221 pounds), playmaking ability and mobility. The LSU product completed 76% of his passes, registered as off target on 7.7% of his throws and posted a 94.9 total QBR during the 2019 season, all of which were best in this year's rookie class. Burrow also adds value with his legs (368 rushing yards, 5 TDs), which only adds to his fantasy upside. Burrow will be a Week 1 starter, but as is the norm for rookie passers, he's a long shot to reach QB1 status in 2020.",
    "otherLeagueDraftValue": 0.28
  },
  {
    "name": "Drew Lock",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 180.0,
    "average": 13.846153846153847,
    "bio": "The Denver defense is in excellent shape behind defensive-minded coach Vic Fangio, so the pressure will be on the second-year Lock to get this team back to the playoffs. The 2019 second-round pick failed to make much noise in five starts as a rookie, averaging a weak 6.5 YPA and managing only one weekly fantasy finish better than 20th. Denver is expected to continue leaning on a run-first offense, though Lock's supporting cast is looking much better after the team added Melvin Gordon, Jerry Jeudy and KJ Hamler to a group that already included Courtland Sutton, Noah Fant and Phillip Lindsay. Not a huge factor as a rusher, Lock figures to be limited to mid-to-back-end QB2 production, though he's an obvious deep sleeper in his second season.",
    "otherLeagueDraftValue": 0.04
  },
  {
    "name": "Daniel Jones",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 176.0,
    "average": 12.571428571428571,
    "bio": "Jones was in and out of the lineup during his rookie campaign, but the 2019 sixth overall pick certainly made an impact when on the field. During 12 starts, Jones paced all rookie QBs with 24 pass TDs and was fifth in fantasy points. Jones' efficiency wasn't good (62% completion rate, 6.6 YPA), but inconsistency is common for rookie passers. Despite the Giants' top targets playing zero games together due to injury, the New York offense ranked 13th in touchdowns during Jones' rookie campaign. Jones is armed with a solid supporting cast and adds value with his legs (he ranked seventh in rushing yards as a rookie). Consider him a fringe top-12 QB and a breakout candidate.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Gardner Minshew II",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 164.0,
    "average": 18.22222222222222,
    "bio": "Minshew's ascent was one of the league's best stories of 2019, as the Washington State star quickly emerged from sixth-round draft pick to the Jaguars' starting quarterback. Minshew appeared in 14 games and tossed 21 touchdowns to only six interceptions. The efficiency wasn't great (61 C%, 7.0 YPA, 19% off-target rate), but Minshew made up some ground with his legs, ranking fifth among QBs with 344 rushing yards. Following the Nick Foles trade to Chicago, Minshew is allbut locked in as the 2020 Jaguars' starter. New offensive coordinator Jay Gruden's resume, combined with Jacksonville's shaky defense, suggests Minshew will be throwing plenty. That's enough to make him a QB2 and deep sleeper.",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Dak Prescott",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 154.0,
    "average": 30.8,
    "bio": "Prescott will be back under center for Dallas following his best professional season in 2019. Prescott ranked no lower than sixth among quarterbacks in pass attempts (596), completions (388), passing yardage (4,902), passing touchdowns (30), yards per pass attempt (8.2) and average depth of throw (9.4) -- all while dealing with a league-high 30 drops. Also a factor as a rusher (52-277-3), Prescott finished a career-best second at the position in fantasy points. Armed with a terrific line, as well as WRs Amari Cooper, Michael Gallup and CeeDee Lamb, Prescott should be considered a solid QB1 option.",
    "otherLeagueDraftValue": 0.09
  },
  {
    "name": "Ryan Fitzpatrick",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 154.0,
    "average": 17.11111111111111,
    "bio": "The Dolphins' 2019 season was about as rough as expected, but the performance improved as the season progressed. That certainly applied to Fitzpatrick, who finished strongly with the third-most fantasy points among QBs during Weeks 12-17. In fact, the combination of Miami's pass-first scheme and Fitzpatrick's rushing production (54-243-4) allowed him the fourth-most fantasy points during the 13 weeks he played a bulk of the snaps. That all being said, Fitzpatrick is 37 years old, will still need to deal with a shaky offensive line and has appeared in 16 games once over the past seven seasons. Fitzpatrick may open the season as Miami's starter, but it won't be long before fifth-overall pick Tua Tagovailoa takes over. Fitzpatrick doesn't need to be drafted.",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Taysom Hill",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 147.0,
    "average": 9.1875,
    "bio": "Hill is back in New Orleans and, while technically a quarterback on the roster, he will continue to operate as a gadget player and thus has tight end eligibility in ESPN Fantasy leagues. In two full regular seasons on the roster, Hill has registered 13 pass attempts, 64 carries and 22 receptions. He caught six touchdowns during the 2019 regular season, but those six came on seven targets inside the 10-yard line, which is obviously unsustainable. Hill's role allowed him no fantasy value when designiated as a QB (one weekly finish better than 18th), but his 2019 point total would've ranked 21st at tight end. He's on the TE2 radar in deep leagues. Note that Hill will be stripped of TE/Flex eligibility and changed to a QB if positioned as the Saints' starter at any point this season.",
    "otherLeagueDraftValue": 0.09
  },
  {
    "name": "Mitchell Trubisky",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 147.0,
    "average": 14.7,
    "bio": "Trubisky is technically atop the Bears' depth chart, but he is no longer assured of Week 1 starting duties following the team's acquisition of Nick Foles. The second overall pick in 2017, Trubisky took a step forward in his second pro season back in 2018 but regressed in nearly every category last season. Despite appearing in 15 games, Trubisky was limited to only three top-10 fantasy weeks and finished 26th in points by season's end. The 25-year-old is barely worth QB2 consideration as a starter, so with Foles lingering, he's obviously well off the fantasy radar.",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Andy Dalton",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 135.0,
    "average": 12.272727272727273,
    "bio": "Dalton signed with Dallas as Dak Prescott's backup after being released by the Bengals. Last season, Dalton appeared in 13 games and racked up 20 total touchdowns to go along with 14 interceptions. He posted his worst YPA (6.6) and completion rate (59%) since his rookie season in 2011. He managed one weekly fantasy finish better than 10th and hasn't finished a season better than 12th in fantasy points since 2013. He's only worth considering for an add if Prescott goes down with an injury.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Tua Tagovailoa",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 132.0,
    "average": 13.2,
    "bio": "Miami selected Tagovailoa with the fifth pick of April's draft. A dominant player during his time at Alabama, Tagovailoa very well could've been selected first overall if not for durability concerns, especially after last season's serious hip injury. Tagovailoa is on the small side (6-foot, 217 pounds) but is a terrific decision-maker with excellent pocket presence and accuracy. His 2019 numbers were outstanding, with his 206.9 QB rating best in class and his 94.8 total QBR just behind Burrow's. Tagovailoa has QB1 upside down the road, but he might open his career behind Ryan Fitzpatrick and is unlikely to land on the fantasy radar in a rebuilding Miami offense.",
    "otherLeagueDraftValue": 0.42
  },
  {
    "name": "Sam Darnold",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 127.0,
    "average": 10.583333333333334,
    "bio": "Darnold's career is off to a slow start, with the USC product having missed three games due to injury/illness during each of his two seasons. He has a total of 39 touchdowns to go along with 28 INTs, and his 60% completion rate and 6.9 YPA are both well below average. Darnold hasn't been afraid to push the ball down the field (8.9 aDOT), but he adds little with his legs and has made little fantasy impact. The 2018 third overall pick posted four top-10 fantasy weeks but was 20th or worse in eight of his other nine outings last season. With an improved line and Chris Herndon back, Darnold's supporting cast is better in 2020, but he'll need a giant leap in order to come close to the QB1 discussion.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Nick Mullens",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 120.0,
    "average": 12.0,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Jalen Hurts",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 113.0,
    "average": 7.533333333333333,
    "bio": "The Eagles found their new backup quarterback when they selected Hurts with the 53rd pick of April's draft. Hurts is a very good athlete with 4.59 40-yard wheels and will be a playmaker as a ball carrier in the pros. The Oklahoma product ran for 1,298 yards and 20 touchdowns on 233 carries last season. Hurts is also fresh off an outstanding 2019 season as a passer, when he was off target on only 8.3% of his throws (second-best in this class) and averaged 11.3 YPA (best) despite a 10.2 aDOT (second-highest). Hurts' accuracy needs work, but he's tough and avoids turnovers. Similar in style to Tyrod Taylor, Hurts has a shot to flirt with QB1 numbers once called upon to start. That won't be anytime soon, barring an injury to Carson Wentz.",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Nick Foles",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 102.0,
    "average": 11.333333333333334,
    "bio": "Foles' roller-coaster career continues as the 31-year-old was traded to Chicago as competition for Mitchell Trubisky. Though Foles has flashed at times, he's never played more than 13 games in a single regular season and has finished only one season better than 29th in fantasy points. Incredibly, Foles has registered exactly two weekly fantasy finishes better than 12th over the past four seasons. That includes a 2019 season in which he had only 117 attempts in Jacksonville due to injury and a later benching. Foles is a non-factor with his legs and may not even open the season as the starter. He's well off the fantasy radar.",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Alex Smith",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 74.0,
    "average": 9.25,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Dwayne Haskins Jr.",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 69.0,
    "average": 9.857142857142858,
    "bio": "The 15th-overall pick of the 2019 draft, Haskins appeared in nine games as a rookie and is expected to open the 2020 season as Washington's starting QB. The word 'expected' is notable here, as his job security is tenuous after new coach Ron Rivera traded for Kyle Allen ' his 2019 starter in Carolina. Haskins will also need to up his game after ranking among the league's worst in completion percentage (59%), off-target rate (22%), and YPA (6.7) on 203 rookie-season attempts. Haskins failed to finish a week better than 10th in fantasy points, and it's hard to expect much improvement in 2020 with an unproven group of targets behind Terry McLaurin and with minimal contributions from his legs.",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Jimmy Garoppolo",
    "position": "QB",
    "auctionPrice": 15,
    "totalPoints": 62.0,
    "average": 10.333333333333334,
    "bio": "The 49ers were the best team in the NFC last season, but that did not lead to much fantasy relevance for Garoppolo. Appearing in more than six games in a single season for the first time in his career, Garoppolo finished 14th in fantasy points and was held to four top-10 weeks (18 QBs had more). Garoppolo tossed 27 touchdowns (fifth most) and was efficient (69% completion rate, 8.4 YPA), but he lacked opportunity in San Francisco's run-heavy offense (he finished 19th in pass attempts) and added very little with his legs (46-62-1 rushing line). Garoppolo has a good supporting cast led by George Kittle, Deebo Samuel and a great line, but the 28-year-old figures to cap out as a QB2 in Kyle Shanahan's run-heavy scheme.",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Mike Glennon",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 59.0,
    "average": 11.8,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Joe Flacco",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 54.0,
    "average": 10.8,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "C.J. Beathard",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 53.0,
    "average": 8.833333333333334,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Brandon Allen",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 50.0,
    "average": 10.0,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Kyle Allen",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 43.0,
    "average": 10.75,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Jake Luton",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 31.0,
    "average": 10.333333333333334,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Jeff Driskel",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 27.0,
    "average": 9.0,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Marcus Mariota",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 25.0,
    "average": 25.0,
    "bio": "Mariota signed with the Raiders during the offseason and will back up Derek Carr. Mariota simply did not live up to the lofty expectations in Tennessee after being selected second overall in the 2015 draft. The Oregon product has been effective with his legs throughout his career (242-1,399-11 rushing line), but he takes a ton of sacks and has become a more conservative passer in recent seasons. Perhaps Mariota can overtake Carr and rejuvenate his career in a new city, but that's unlikely to happen, which obviously pushes the 26-year-old well off the fantasy radar.",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Chad Henne",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 22.0,
    "average": 7.333333333333333,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Mason Rudolph",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 21.0,
    "average": 4.2,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Jacoby Brissett",
    "position": "QB",
    "auctionPrice": 0,
    "totalPoints": 18.0,
    "average": 1.6363636363636365,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Derrick Henry",
    "position": "RB",
    "auctionPrice": 45,
    "totalPoints": 388.0,
    "average": 24.25,
    "bio": "Henry returns as the feature back in Tennessee after pacing the NFL in carries (303), rushing yards (1,540) and rushing touchdowns (16) in 2019. Henry has been an absolute force as a rusher, ranking no lower than third in YAC each of the past three seasons. His heavy recent workload is a concern, but the good news is that he's 25 years old and had not cleared 215 carries in a season prior to 2019. Henry's minimal workload as a receiver (career-high 18 receptions last season) will continue to limit his fantasy output, so coupled with a probable dip in rushing production, he should be valued as a back-end RB1.",
    "otherLeagueDraftValue": 57.32
  },
  {
    "name": "Dalvin Cook",
    "position": "RB",
    "auctionPrice": 48,
    "totalPoints": 378.0,
    "average": 27.0,
    "bio": "Cook's career has thus far been marred by injuries, but we saw a glimpse of his ceiling during a breakout 2019 campaign. Through Week 14, Cook led the league in rushing touchdowns and trailed only Christian McCaffrey in fantasy points. Cook missed two games and chunks of others but still finished no lower than ninth among backs in carries, receptions, touches, scrimmage yards and touchdowns. Cook's 15 carries inside the 5 were third most in the league, and he scored at least one touchdown in 11 of 14 games. Cook has now missed 19 games because of injury in three seasons, but there's no doubt the 24-year-old is positioned well as run-heavy Minnesota's primary back. He's a strong RB1 despite the durability concerns.",
    "otherLeagueDraftValue": 58.46
  },
  {
    "name": "Alvin Kamara",
    "position": "RB",
    "auctionPrice": 51,
    "totalPoints": 373.0,
    "average": 24.866666666666667,
    "bio": "Kamara is coming off an up-and-down 2019 campaign, but the 24-year-old remains the main man in the New Orleans' backfield. Kamara missed a pair of games but otherwise played a similar role to 2018, handling 12.2 carries and 7.0 targets per game. Kamara ended the season with a YPC above 4.5 and exactly 81 catches for the third consecutive season. A lack of usage near the goal line (7.1 OTD, 6 TDs) limited his fantasy production, though he did finish strongly with four of those scores coming during Weeks 16-17. Kamara should have little trouble pushing for 20 touches per game in the Saints' Drew Brees-led, high-scoring offense. He remains a solid RB1.",
    "otherLeagueDraftValue": 60.83
  },
  {
    "name": "David Montgomery",
    "position": "RB",
    "auctionPrice": 6,
    "totalPoints": 268.0,
    "average": 17.866666666666667,
    "bio": "Montgomery's rookie season didn't go as planned, but the 2019 third-round pick remains atop the Chicago depth chart. The Iowa State product wasn't short on volume in his first season, ranking 12th among backs in touches and sixth in carries inside the 5 (14). The problem was a combination of poor rushing efficiency (3.7 YPC, 1.6 YAC) and a lack of volume and effectiveness as a pass-catcher (185 yards on 37 targets). The end result was two top-15 fantasy weeks and a 24th-place finish by season's end. Montgomery will continue to defer passing-down work to Tarik Cohen but is certainly a breakout candidate in his second season. Montgomery is a flex option with RB2 upside.",
    "otherLeagueDraftValue": 22.79
  },
  {
    "name": "Aaron Jones",
    "position": "RB",
    "auctionPrice": 32,
    "totalPoints": 266.0,
    "average": 19.0,
    "bio": "It's fair to say Jones was finally 'freed' in 2019. Green Bay's lead back set career-high marks in nearly every category, exploding for 1,558 yards (seventh most among RBs) and a league-high 19 touchdowns from scrimmage. Jones posted more duds than you'd expect from a top fantasy back (five weekly finishes outside the top 30), but still managed the second-most points at the position. Jones is a near lock for major touchdown regression this season, as his 19 TDs were nearly double his 10.8 OTD. Still, his strong efficiency and role as lead back in the Packers' offense is enough to allow the 25-year-old Jones solid RB1 numbers.",
    "otherLeagueDraftValue": 51.85
  },
  {
    "name": "Jonathan Taylor",
    "position": "RB",
    "auctionPrice": 19,
    "totalPoints": 263.0,
    "average": 17.533333333333335,
    "bio": "The Colts surprisingly nabbed Taylor with the 41st pick of April's draft. An outstanding prospect purely from a rushing standpoint, the Wisconsin product paced this year's rookie class in carries, rushing yards and rushing touchdowns and ranked fourth with a 3.7 YAC in 2019. Taylor also crushed it at February's combine, running a position-best 4.39 40 and a solid 7.01 three cone despite a hefty 5-foot-10, 226-pound frame. The main concerns here are fumbles (18) and pass-catching ability (nine drops on 68 targets). Taylor has RB1 upside down the road, but his short-term fantasy value will suffer with incumbent early-down back Marlon Mack and passing-down specialist Nyheim Hines in the fold. Taylor is worth grabbing in the middle rounds, but it might take some time before he's a reliable fantasy starter.",
    "otherLeagueDraftValue": 9.77
  },
  {
    "name": "James Robinson",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 254.0,
    "average": 18.142857142857142,
    "bio": "",
    "otherLeagueDraftValue": 24.71
  },
  {
    "name": "Nick Chubb",
    "position": "RB",
    "auctionPrice": 58,
    "totalPoints": 231.0,
    "average": 19.25,
    "bio": "Chubb has emerged as one of the league's most-effective rushers since being selected in the second round of the 2018 draft. He ranks first in YPC (5.1) and second in YAC (2.3) among 25 backs with at least 300 carries during that span. Chubb was fantasy's No. 8 scoring back in 2019, thanks to the fourth-most touches and second-most total yardage at the position. However, we can't ignore that Chubb's usage and fantasy production dipped once Kareem Hunt returned from suspension (RB6 before, RB15 after). Hunt will be in the mix from the get-go in 2020, which will certainly limit Chubb's output. Consider Chubb a borderline top-10 RB with more value in non-PPR leagues.",
    "otherLeagueDraftValue": 5.3
  },
  {
    "name": "Josh Jacobs",
    "position": "RB",
    "auctionPrice": 35,
    "totalPoints": 227.0,
    "average": 15.133333333333333,
    "bio": "Jacobs returns as the feature back for the Raiders following an extremely impressive rookie campaign. The 2019 first-round pick averaged a healthy 4.75 YPC on 242 attempts and ranked fourth among backs with a 2.25 YAC. Jacobs flashed with four top-10 fantasy weeks but missed three games because of injury, and his output was capped by a limited role as a receiver (27 targets). Coach Jon Gruden has consistently expressed a desire to target Jacobs more often, which adds some optimism that Jacobs can become a workhorse back. Of course, until that actually happens, the 22-year-old is best valued as a fringe top-12 fantasy back.",
    "otherLeagueDraftValue": 44.18
  },
  {
    "name": "Ezekiel Elliott",
    "position": "RB",
    "auctionPrice": 70,
    "totalPoints": 224.0,
    "average": 14.933333333333334,
    "bio": "Elliott returns as the clear feature back in Dallas. Since entering the league in 2016, the Ohio State product leads the NFL in carries (1,169) and rushing yards (5,405), and sits second in rushing touchdowns (40). Elliott obviously plays a substantial role as a ball carrier -- and his goal-line work increased last season -- but it was a bit surprising to see his targets fall from 6.3 to 4.4 per game last season. Of course, Elliott's role still allowed him a top-3 finish in touches, yards and fantasy points. The 25-year-old is positioned for a similar role in 2020 behind a strong offensive line and should be off the board in the middle of the first round of drafts.",
    "otherLeagueDraftValue": 47.2
  },
  {
    "name": "Kareem Hunt",
    "position": "RB",
    "auctionPrice": 2,
    "totalPoints": 206.0,
    "average": 12.875,
    "bio": "Hunt returns to Cleveland, where he'll operate as a change-of-pace rusher and primary receiving back behind Nick Chubb. Hunt was, of course, one of fantasy's top backs prior to off-field issues leading to roughly one year out of the league. He returned in Week 10 last season and played a substantial role from that point on. Hunt was on the field for 60% of the snaps, handling 5.4 carries and 5.5 targets per game. Hunt was fantasy's No. 17 RB during the stretch and trailed Chubb by only three fantasy points during that span. Chubb will continue to handle most of the carries and goal-line work, but Hunt's role allows him standalone value, not to mention that he's arguably the most valuable insurance policy in fantasy.",
    "otherLeagueDraftValue": 18.82
  },
  {
    "name": "Antonio Gibson",
    "position": "RB",
    "auctionPrice": 3,
    "totalPoints": 204.0,
    "average": 14.571428571428571,
    "bio": "Washington selected Gibson with the 66th pick of April's draft. Gibson appeared to be entering the league as more of an 'offensive weapon' than a wide receiver or running back, but he has settled in as the team's lead back, even drawing comparisons to Christian McCaffrey by head coach Ron Rivera. The Memphis product is big (6-foot, 228 pounds) and a terrific athlete with excellent power, speed (4.39 40-yard dash) and elusiveness. He's a terror with the ball in his hands, having averaged 8.4 yards per carry and 13.1 yards per target (11.9 RAC) in 2019. Experience is a concern here (33 carries and 66 targets in two FBS seasons), but it appears he's done enough to play a huge role as a rookie. Consider Gibson a flex option with upside.",
    "otherLeagueDraftValue": 19.99
  },
  {
    "name": "Melvin Gordon III",
    "position": "RB",
    "auctionPrice": 19,
    "totalPoints": 201.0,
    "average": 13.4,
    "bio": "Gordon signed on as the Broncos' new lead back, following five seasons with the Chargers. Gordon is fresh off a season when he held out for a month before posting 162-612-8 rushing and 42-296-1 receiving lines. That was enough for the 12th-most fantasy points during that span. Gordon entered 2019 having finished the previous three seasons no lower than ninth in scrimmage yards, sixth in touchdowns and eighth in fantasy points among backs. In Denver's run-heavy offense, Gordon figures to share a chunk of the carries with Phillip Lindsay, but his bigger frame should garner him more goal-line work, and he's also the superior receiver. Gordon is a mid-to-back end RB2.",
    "otherLeagueDraftValue": 5.21
  },
  {
    "name": "Ronald Jones II",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 198.0,
    "average": 14.142857142857142,
    "bio": "Following what was a disastrous rookie season in 2018, Jones added weight and got his career back on track with an impressive showing in 2019. After totaling 77 yards on 30 touches in 2018, Jones produced 1,003 yards and six touchdowns on 203 touches last season. Despite his second-round pedigree and superior play relative to his counterparts in the Tampa Bay backfield, Jones was limited to only 37% of the snaps and 47% of the designed runs. It's very possible we've yet to see the best of Jones, as he was drafted very young and is entering his age-23 season. However, following the offseason additions of Leonard Fournette, LeSean McCoy and Ke'Shawn Vaughn, Jones is not an appealing flex options. He should be on benches unless he earns clear lead duties.",
    "otherLeagueDraftValue": 17.96
  },
  {
    "name": "Mike Davis",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 195.0,
    "average": 13.0,
    "bio": "",
    "otherLeagueDraftValue": 0.2
  },
  {
    "name": "Kenyan Drake",
    "position": "RB",
    "auctionPrice": 22,
    "totalPoints": 193.0,
    "average": 12.866666666666667,
    "bio": "Drake received the transition tag from the Cardinals during the offseason and will return as the team's clear feature back. Traded from Miami to Arizona at the 2019 trade deadline, Drake went on to play 381 (79%) of 483 possible snaps during his eight games with the team. He handled 66% of the team's carries (15.4 per game) and 14% of the targets (4.4) during that span. That heavy usage allowed him the fourth-most fantasy points among RBs during that span. Arizona's offense should only improve in Kliff Kingsbury and Kyler Murray's second season, so Drake, who sports an impressive 4.8 career YPC, is very much in the RB1 discussion.",
    "otherLeagueDraftValue": 8.55
  },
  {
    "name": "D'Andre Swift",
    "position": "RB",
    "auctionPrice": 6,
    "totalPoints": 184.0,
    "average": 14.153846153846153,
    "bio": "The Lions selected Swift with the 35th pick of April's draft. Swift was terrific in Georgia's pro-style offense, producing as both a rusher (440 carries) and receiver (73 receptions) during his three seasons. His efficiency was more solid than spectacular, and he lacks some explosiveness, but he makes up for it with reliability, decent speed (4.48 40-yard dash), quickness and pass-catching prowess. Swift has three-down upside but will begin his career competing for reps with Kerryon Johnson, who figures to focus primarily on ball-carrying, with Swift busier in passing situations. That's likely to limit Swift's fantasy output, but he certainly could flirt with RB2 numbers and is worth a midround pick.",
    "otherLeagueDraftValue": 9.01
  },
  {
    "name": "Miles Sanders",
    "position": "RB",
    "auctionPrice": 23,
    "totalPoints": 179.0,
    "average": 14.916666666666666,
    "bio": "It took a while for him to get rolling, but Sanders certainly took command of lead-back duties in Philadelphia during the second half of his rookie season. Sanders put down a solid 179-818-3 rushing line, but where he truly stood out was as a receiver. Sanders' 50-509-3 line was fueled by 8.2 yards per target, which was second best at the position. Sanders didn't play more than 53% of the snaps in a game until Week 11, but he finished 15th among backs in fantasy points. The 23-year-old is primed for a larger share of the workload behind the Eagles' elite offensive line in 2020. Consider him a strong RB2 with upside for more.",
    "otherLeagueDraftValue": 21.64
  },
  {
    "name": "David Johnson",
    "position": "RB",
    "auctionPrice": 18,
    "totalPoints": 178.0,
    "average": 14.833333333333334,
    "bio": "Johnson was one of the league's best backs during his first two seasons, but struggles with injuries and efficiency led to a benching last season and was followed by an offseason trade to Houston. The 28-year-old is well-positioned for a rebound campaign with passing-down specialist Duke Johnson as his only competition for touches. The question is: Is he up for it? Johnson averaged an ugly 3.6 YPC and 1.4 YAC during the past three seasons. He remains an effective receiver but figures to focus primarily on rushing the ball with Duke Johnson in the picture. Johnson can't be counted on as an elite fantasy asset, but he has a path to enough volume to allow midrange RB2 production.",
    "otherLeagueDraftValue": 11.6
  },
  {
    "name": "J.D. McKissic",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 178.0,
    "average": 11.125,
    "bio": "McKissic signed with Washington and has a shot to open the 2020 season as the team's primary passing-down back. He could have some value in the deepest of PPR leagues, but his ceiling is very low considering he won't carry the ball much and will lose a lot of targets to rookie Antonio Gibson. Peyton Barber and perhaps Bryce Love are also in the mix.",
    "otherLeagueDraftValue": 3.23
  },
  {
    "name": "Nyheim Hines",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 177.0,
    "average": 11.0625,
    "bio": "Marlon Mack and Jonathan Taylor are the Colts' primary ball carriers, but it's Hines who has been handling passing situations. The 2018 fourth-round pick ranked eighth among backs in routes and seventh in targets with Andrew Luck in 2018 before falling to 27th and 16th, respectively, with Jacoby Brissett last season. Hines' receiving efficiency has been a problem (career 5.3 YPT and nine drops), and his 190-pound frame hasn't allowed him much volume or efficiency as a rusher (3.7 YPC on 137 career carries) or in the scoring department (six career TDs). Perhaps Philip Rivers will inject some life into Hines' fantasy stock, but the third-year back will need to significantly improve his game. He's worth only a late flier in PPR.",
    "otherLeagueDraftValue": 0.99
  },
  {
    "name": "Chris Carson",
    "position": "RB",
    "auctionPrice": 23,
    "totalPoints": 174.0,
    "average": 14.5,
    "bio": "Carson put together another solid season as Seattle's lead back in 2019 and returns atop the depth chart for 2020. The 2017 seventh-round pick has missed a total of three games over the past two seasons but finished fifth in rushing yards during both campaigns. Carson has been of value near the goal line (18 touchdowns) and in terms of efficiency (2.26 YAC is fourth best) during that span. Seattle ramped up Carson's passing-game workload last season, which gives him a better shot at his third-consecutive top-15 fantasy campaign, but the 25-year-old will need to fend off Rashaad Penny and rookie DeeJay Dallas for snaps. Consider Carson a fine RB2 target.",
    "otherLeagueDraftValue": 32.18
  },
  {
    "name": "Clyde Edwards-Helaire",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 174.0,
    "average": 13.384615384615385,
    "bio": "Edwards-Helaire is in running back paradise after Andy Reid and the Chiefs selected him with the 32nd pick of April's draft. The LSU product isn't particularly fast (4.60 40-yard dash) and is on the small side at 5-foot-7, 207 pounds, but he sports elite elusiveness and tackle-breaking ability. Edwards-Helaire also paced this year's rookie class in targets (65), receptions (55) and receiving yards (453) last season. He has three-down upside, though it's possible his frame could cost him goal-line touches.  Edwards-Helaire's short-term production got a big boost when potential counterpart Damien Williams opted out for the season, which positions the rookie as the clear feature back in the Chiefs' high-scoring, Patrick Mahomes-led offense. He's immediately in the RB1 mix.",
    "otherLeagueDraftValue": 10.58
  },
  {
    "name": "J.K. Dobbins",
    "position": "RB",
    "auctionPrice": 3,
    "totalPoints": 172.0,
    "average": 11.466666666666667,
    "bio": "Baltimore grabbed its lead running back of the future by selecting Dobbins with a second-round pick in April's draft. Dobbins is an outstanding athlete with terrific speed, balance and playmaking ability. He sports a 5-foot-9, 209-pound frame and is a three-down option with the ability to contribute as an impact rusher and receiver. In his final season at Ohio State, Dobbins' 2,003 rushing yards and 21 touchdowns tied for tops in this year's rookie class. His 3.5 YAC was sixth. Landing in Baltimore's high-scoring offense sets up Dobbins with a massive long-term ceiling, but he's likely to be utilized as a change-of-pace back in the short term, with Mark Ingram, Gus Edwards and second-year Justice Hill also on the roster. Dobbins won't have much early-season fantasy value but will be a strong end-of-bench stash during the 2020 season.",
    "otherLeagueDraftValue": 0.47
  },
  {
    "name": "James Conner",
    "position": "RB",
    "auctionPrice": 25,
    "totalPoints": 168.0,
    "average": 12.923076923076923,
    "bio": "Conner returns as the lead back in Pittsburgh, but durability has become a significant concern for a player who has missed at least two games in each of his three NFL seasons. Despite missing three games in 2018, Conner broke out with 1,462 yards and 13 TDs on 269 touches en route to finishing sixth among running backs in fantasy points. He sat ninth at the position through Week 8 last season, but injuries limited him to 54 snaps the rest of the season. A return to full health by Conner and Ben Roethlisberger very well could lead to a bounce-back campaign for the 25-year-old, though he'll need to fend off Benny Snell Jr., Jaylen Samuels and rookie Anthony McFarland Jr. for touches. Consider Conner a flex option.",
    "otherLeagueDraftValue": 36.07
  },
  {
    "name": "Myles Gaskin",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 159.0,
    "average": 15.9,
    "bio": "",
    "otherLeagueDraftValue": 22.3
  },
  {
    "name": "Todd Gurley II",
    "position": "RB",
    "auctionPrice": 19,
    "totalPoints": 156.0,
    "average": 10.4,
    "bio": "Gurley is now the lead back in Atlanta following five seasons with the Rams. The Georgia product was a top-three fantasy RB in both 2017 and 2018, but he handled a lesser workload and struggled badly with efficiency in 2019 while dealing with knee and ankle concerns. After averaging 4.89 YPC (2.11 YAC) on 256 carries and 7.4 yards per target on 78 targets in 14 games in 2018, Gurley's numbers plummeted to 3.84 YPC (1.81 YAC) on 223 carries and 4.2 YPT on 49 targets in 15 games last season. Gurley still managed a 14th-place finish in fantasy points (his fifth top-15 in as many tries), thanks to 14 touchdowns. Gurley's durability is a big concern, but he has little competition for touches in a good offense. He's a fine RB2 target.",
    "otherLeagueDraftValue": 14.26
  },
  {
    "name": "Austin Ekeler",
    "position": "RB",
    "auctionPrice": 50,
    "totalPoints": 154.0,
    "average": 15.4,
    "bio": "Ekeler received a contract extension, and former running mate Melvin Gordon is now in Denver, which locks in the former as the Chargers' lead back in 2020. Ekeler took his game to a new level last season, especially as a receiver, ranking no lower than second among backs in targets, receptions, yards and touchdowns. Despite Gordon playing a substantial role in 12 games, Ekeler was fantasy's No. 4 scoring back. Ekeler's small frame will limit his carries and goal-line work (he's never cleared 132 carries or three rushing touchdowns in a season), and he's unlikely to repeat a 91-992-8 receiving line with Tyrod Taylor and Justin Herbert under center. Expect a step back for Ekeler, though his role can still allow borderline RB1 production in PPR.",
    "otherLeagueDraftValue": 2.53
  },
  {
    "name": "Chase Edmonds",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 148.0,
    "average": 9.25,
    "bio": "Edmonds is expected to enter the 2020 season as Kenyan Drake's primary backup. The third-year back has operated as a reserve in 28 of 29 career games, but the one exception was an explosive Week 7 effort against the Giants last season in which he put up 150 yards and three scores on 29 touches. Edmonds went on to touch the ball nine times the rest of the season while dealing with injuries and the emergence of Drake. Edmonds' backup status is all but secured with David Johnson no longer in the mix (seventh-round pick Eno Benjamin is his chief competition), so though the 24-year-old has no stand-alone value, he's valuable insurance and thus worth a stash in deeper leagues.",
    "otherLeagueDraftValue": 3.12
  },
  {
    "name": "Jeff Wilson Jr.",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 145.0,
    "average": 12.083333333333334,
    "bio": "",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Giovani Bernard",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 143.0,
    "average": 8.9375,
    "bio": "Bernard is a change-of-pace and passing-down complement to Joe Mixon in Cincinnati. The 28-year-old has been a solid presence throughout his seven-year NFL career, but his fantasy contributions have declined significantly the past four seasons. A top-20 back in both targets and fantasy points in his first three seasons, Bernard ranked 32nd in targets in 2020 and has one top-40 fantasy season in the past four campaigns. Bernard would need a Mixon injury to approach fantasy relevance, and even then, he's likely to operate in a timeshare.",
    "otherLeagueDraftValue": 0.33
  },
  {
    "name": "Devin Singletary",
    "position": "RB",
    "auctionPrice": 6,
    "totalPoints": 136.0,
    "average": 8.5,
    "bio": "An injury may have limited Singletary's early-season contributions during his rookie campaign, but the 2019 third-round pick quickly overtook Frank Gore upon his return. During Weeks 8-16, Singletary handled a generous 14.9 carries and 4.0 targets per game. He was held to three touchdowns but was ninth among RBs in scrimmage yards, while playing 74% of the snaps during that span. Though he struggled after contact, Singletary's 5.1 YPC was sixth best among backs. Singletary is expected to work as the lead back again this season, but his 5-foot-7, 203-pound frame will limit his volume. Expect rookie Zack Moss to be heavily involved, along with Josh Allen, at the goal line. Singletary may struggle to clear a half-dozen touchdowns but will get enough work to flirt with top-20 production.",
    "otherLeagueDraftValue": 2.27
  },
  {
    "name": "Wayne Gallman",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 130.0,
    "average": 8.666666666666666,
    "bio": "",
    "otherLeagueDraftValue": 0.16
  },
  {
    "name": "Leonard Fournette",
    "position": "RB",
    "auctionPrice": 33,
    "totalPoints": 128.0,
    "average": 9.846153846153847,
    "bio": "Fournette signed with Tampa Bay after being cut by the Jaguars. At least from a fantasy perspective, Fournette finally lived up to his first-round pedigree during a breakout 2019 season and emerged as one of the league's rare workhorse running backs. During 15 active weeks, Fournette played 88% of the snaps, handling 87% of the carries and 19% of the targets. Fournette finished no lower than seventh among backs in carries, targets, receptions, touches, yards and fantasy points. Fournette's season would've been even more impressive had it not been for some atrocious touchdown luck. Despite a healthy 9.3 OTD (10th highest), Fournette scored three touchdowns. He may lead Tampa Bay in touches this season, but he won't be a workhorse with Ronald Jones and LeSean McCoy (among others) in the mix. Consider him a borderline flex option.",
    "otherLeagueDraftValue": 1.48
  },
  {
    "name": "Latavius Murray",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 126.0,
    "average": 8.4,
    "bio": "Murray is now 30 years old, but he remains in a good spot as Alvin Kamara's backup in a high-scoring Saints' offense. In his first season in New Orleans, Murray was held to 98 touches and the 49th-most fantasy points among backs during the 14 weeks Kamara was also active. However, with Kamara sidelined during Weeks 7 and 8, Murray stepped in and racked up 307 yards and four touchdowns on 60 touches. He was fantasy's top-scoring RB in that span. Murray lacks stand-alone value but is obviously an elite insurance option.",
    "otherLeagueDraftValue": 1.11
  },
  {
    "name": "Gus Edwards",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 125.0,
    "average": 7.8125,
    "bio": "Edwards was the second man up for carries behind Mark Ingram last season, but he could fall to third this season with second-round pick J.K. Dobbins in the mix. The backup gig was generous to Edwards in 2019, as it allowed him 133 carries in the league's highest-scoring offense. Edwards is a nonfactor in the passing game (he has 270 carries and 10 targets in two seasons), but his rushing efficiency has been nothing short of elite. In fact, Edwards' career 5.3 YPC is best among 40 backs with 200-plus carries since he entered the league as an undrafted free agent in 2018. Edwards can no longer be considered Ingram's clear backup, and even if Ingram misses time, Edwards would work in a timeshare with Dobbins and perhaps Justice Hill. Edwards is worth a pick only in deep non-PPR leagues.",
    "otherLeagueDraftValue": 0.05
  },
  {
    "name": "Darrell Henderson Jr.",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 123.0,
    "average": 8.2,
    "bio": "Henderson will get a shot at earning lead-back duties in the Rams' backfield this season following the release of Todd Gurley. Henderson was initially expected to play a significant change-of-pace role behind Gurley last season but instead was limited to 39 carries and six targets on 89 snaps. The Rams selected Henderson in the third round of the 2019 draft after he averaged 8.9 YPC (seriously!) on 344 carries during his final two seasons at Memphis. Henderson has tremendous upside as a rusher, and his passing-down chops make him a candidate for weekly PPR value, but he'll be hard-pressed to separate himself from rookie Cam Akers (and perhaps Malcolm Brown) as the team's clear feature back. Nonetheless, Henderson is a second-year breakout candidate and borderline flex option.",
    "otherLeagueDraftValue": 3.58
  },
  {
    "name": "Jerick McKinnon",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 117.0,
    "average": 7.3125,
    "bio": "McKinnon signed a pricy contract with San Francisco prior to the 2018 season but has yet to play a snap for the team due to injury. Following a contract restructure, McKinnon will attempt another comeback in 2020. Even prior to the injury struggles, the 5-foot-9, 212-pound McKinnon had never exceeded 159 carries in a season and averaged 3.59 YPC (worst among backs), including 1.50 after contact (second worst) on 309 carries during the 2016 and 2017 seasons. McKinnon's receiving volume has been terrific, but his efficiency has been weak (5.2 YPT). The 49ers' run-heavy offense is attractive, but McKinnon's lengthy absence and the presences of Raheem Mostert and Tevin Coleman make fantasy relevance a long shot.",
    "otherLeagueDraftValue": 1.89
  },
  {
    "name": "Jamaal Williams",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 117.0,
    "average": 8.357142857142858,
    "bio": "Williams returns as a backup rusher and passing-down contributor in Green Bay, though he'll face more competition for work this season, with second-round pick AJ Dillon in the fold. In 13 full games last season, Williams was well behind Aaron Jones in carries (179 to 107) but was basically even in targets (46 to 45). Jones was a top-five fantasy RB in those 13 weeks, though it might surprise you to know that Williams was 24th. There are plenty of fantasy points to be had in the Packers' backfield, but Williams, who has yet to post a top-30 fantasy campaign, might not even be the team's lead back if Jones gets injured. He's barely worthy of a draft pick in most formats.",
    "otherLeagueDraftValue": 1.03
  },
  {
    "name": "Adrian Peterson",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 114.0,
    "average": 7.125,
    "bio": "Peterson was released by Washington just prior to Week 1. Peterson ranked 17th among running backs with 898 rushing yards last season but didn't score much (five TDs) and was a nonfactor as a receiver (23 targets). Peterson is still an effective rusher at age 35, but the reigning No. 33 scoring fantasy back had zero top-10 fantasy weeks in 2019 and is a strong bet for a significant decrease in touches in 2020 regardless of landing spot. ",
    "otherLeagueDraftValue": 1.01
  },
  {
    "name": "Tony Pollard",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 110.0,
    "average": 6.875,
    "bio": "Pollard remains Ezekiel Elliott's primary backup as he enters his second NFL season. The 2019 fourth-round pick generated some hype last offseason during Elliott's holdout but ended up touching the ball only 101 times during his rookie campaign. Pollard showed well ' he averaged 5.3 YPC, and his 2.7 YAC was tops in the league ' but didn't see the field much, with Elliott appearing in all 16 games. Pollard is unlikely to produce stand-alone value, but he has the size and skill set to take on a substantial chunk of Elliott's workload, should Elliott miss time. Stash Pollard on your bench.",
    "otherLeagueDraftValue": 0.07
  },
  {
    "name": "James White",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 107.0,
    "average": 7.642857142857143,
    "bio": "White has finished as a top-20 fantasy RB each of the past two seasons, but he's a bit of a wild card now that old reliable Tom Brady is out of the picture. We can't bank on carries from White (he has never cleared 94 in a single season), but he has ranked no lower than sixth among backs in targets, catches, receiving yards and touchdown receptions each of the past two seasons. White is a strong bet to remain New England's primary passing-down back, but we can't assume Cam Newton or Jarrett Stidham will target him as often, and the safe bet would be to expect less scoring and a more run-heavy approach from the Patriots' offense. White still has PPR value, but he's more of a fringe flex with a limited ceiling.",
    "otherLeagueDraftValue": 4.63
  },
  {
    "name": "Damien Harris",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 102.0,
    "average": 10.2,
    "bio": "Harris enters his second NFL season as part of a crowded New England backfield that includes Sony Michel, James White, Rex Burkhead and Brandon Bolden. A third-round pick last offseason, Harris was limited to five snaps during his rookie campaign. He lacks top-end speed (4.57 40-yard dash) but has decent size (5-foot-10, 216 pounds) and is a powerful, downhill runner with exceptional ball security (zero fumbles in 2018). He's also a good pass-catcher and blocker, which supplies him with three-down upside in the pros. Harris is buried in New England, but one injury could vault him into a big role. He's an end-of-bench stash at best.",
    "otherLeagueDraftValue": 1.23
  },
  {
    "name": "Cam Akers",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 100.0,
    "average": 7.6923076923076925,
    "bio": "The Rams selected Akers with the 52nd pick of April's draft. The tough and elusive Akers measures in at 5-foot-10, 217 pounds with solid speed (4.47 40-yard dash) and good strength (20 bench reps). Despite lacking some big-play ability and having to do most of his damage after contact last season (5.0 YPC, 1.7 YBC), Akers posted one of the best YAC/forced missed tackle profiles in this year's rookie class. The Florida State product will open his career in a wide-open competition with second-year back Darrell Henderson and Malcolm Brown to replace Todd Gurley. He might not do much as a receiver, but if Akers is able to claim a majority of the carries and goal-line work, he could quickly join the RB2 discussion. Grab him in the middle rounds.",
    "otherLeagueDraftValue": 0.04
  },
  {
    "name": "Raheem Mostert",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 100.0,
    "average": 12.5,
    "bio": "It's not often you see a running back break out in his fifth NFL campaign, but Mostert did exactly that down the stretch last season. Primarily a special-teams player throughout his career, Mostert put up 859 yards and scored 13 touchdowns on 133 touches during the 49ers' final nine games of 2019 (including the playoffs). An extremely efficient runner, Mostert is averaging 6.0 YPC on 178 regular-season carries for his career, which is easily best among 188 RBs with 150-plus carries. The concerns here are that Mostert plays a minimal pass-catching role (22 targets last season) and Kyle Shanahan is very unpredictable with his backfield rotation. As such, Mostert is best viewed as a flex with RB2 upside.",
    "otherLeagueDraftValue": 1.12
  },
  {
    "name": "Joe Mixon",
    "position": "RB",
    "auctionPrice": 28,
    "totalPoints": 99.0,
    "average": 16.5,
    "bio": "Mixon enters his fourth NFL season as the clear feature back in Cincinnati. The role has allowed Mixon a top-seven finish in touches, top-11 finish in yards and eight-plus touchdowns each of the past two seasons. Despite the heavy usage, a limited role as a pass-catcher has left Mixon with fantasy finishes of 10th and 13th during that span. Mixon is one of the game's better talents at the position, but the Cincinnati offensive line remains a work in progress and his target share is unlikely to see a significant boost with A.J. Green back, Tee Higgins drafted and Giovani Bernard still in the fold. Consider Mixon a borderline top-10 RB.",
    "otherLeagueDraftValue": 33.93
  },
  {
    "name": "Malcolm Brown",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 99.0,
    "average": 6.1875,
    "bio": "With Todd Gurley out of the picture in Los Angeles, Brown will compete with second-year Darrell Henderson and rookie Cam Akers for touches in the Rams' backfield. Brown is entering his sixth NFL season having yet to eclipse 69 carries or 11 targets in a campaign. Brown could factor in on early downs and near the goal line (he's 224 pounds and scored five touchdowns last season) but is a long shot for anything more than situational duties and is unlikely to factor in as a receiver. Consider him for your bench in deep leagues.",
    "otherLeagueDraftValue": 0.34
  },
  {
    "name": "Rex Burkhead",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 96.0,
    "average": 9.6,
    "bio": "Burkhead returns to a crowded backfield in New England that includes Sony Michel, James White, Damien Harris and Brandon Bolden. Burkhead is entering his age-30 season having never cleared 74 carries or 38 targets in a season. His best fantasy finish was 39th in 2017. Burkhead would need multiple injuries to emerge as a reliable weekly fantasy starter, and even then, he might not be overly appealing with Tom Brady no longer under center. Burkhead is worth a look only in the deepest of leagues.",
    "otherLeagueDraftValue": 0.35
  },
  {
    "name": "Zack Moss",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 92.0,
    "average": 7.076923076923077,
    "bio": "The Bills selected Moss with a third-round pick in April's draft. Moss is an elite prospect in two key areas: YAC (second-best in this year's rookie class in 2019) and forced missed tackles (second). The Utah product has terrific size (5-foot-9, 223 pounds) and the balance, toughness, quickness and receiving ability to emerge as one of the game's top backs, though speed is a major concern following his 4.65 40-yard dash at the combine. Moss joins Devin Singletary in the Bills' backfield. The two figure to limit each other's fantasy output, though the rookie has 20 pounds on his new teammate, which could vault him into a significant role on early downs and at the goal line. Moss could flirt with the flex radar and is a fine mid-round target.",
    "otherLeagueDraftValue": 0.25
  },
  {
    "name": "Frank Gore",
    "position": "RB",
    "auctionPrice": 0,
    "totalPoints": 92.0,
    "average": 6.133333333333334,
    "bio": "",
    "otherLeagueDraftValue": 0.24
  },
  {
    "name": "Davante Adams",
    "position": "WR",
    "auctionPrice": 49,
    "totalPoints": 375.0,
    "average": 26.785714285714285,
    "bio": "Adams is back as Aaron Rodgers' unquestioned No. 1 target -- a role that has allowed him to post four consecutive seasons as a top-10 WR in fantasy points per game. Adams handled a career-high 31% target share and was fantasy's No. 2-scoring WR during the 12 weeks in which he was active last season. He finished as a top-five WR in 42% of those outings, which trailed only Michael Thomas. The only concern here is durability as Adams has missed at least one regular-season game due to injury in each of the past three seasons, including four 2019 absences. We'll need to dock him slightly for that, but the 27-year-old's massive usage locks him into the top-end WR1 mix.",
    "otherLeagueDraftValue": 52.95
  },
  {
    "name": "Stefon Diggs",
    "position": "WR",
    "auctionPrice": 25,
    "totalPoints": 350.0,
    "average": 21.875,
    "bio": "Diggs was traded to Buffalo during the offseason and will now operate as the Bills' top target. The 26-year-old posted a trio of top-25 fantasy campaigns during his final three seasons in Minnesota, but now moves to a low-volume, run-first Buffalo offense led by the inefficient and scramble-heavy Josh Allen. That figures to lead to a decrease in production for Diggs, which is a concern considering he was only the WR24 last season -- despite Kirk Cousins' extremely efficient campaign and with Adam Thielen sidelined. Diggs, who has never appeared in all 16 games of a regular season, is likely to be over-drafted and is best viewed as only a WR3.",
    "otherLeagueDraftValue": 30.6
  },
  {
    "name": "Tyreek Hill",
    "position": "WR",
    "auctionPrice": 50,
    "totalPoints": 329.0,
    "average": 21.933333333333334,
    "bio": "Hill heads into his fifth NFL season having never finished lower than fourth among WRs in fantasy points per snap. Last season, the speedster missed four games because of injury and saw a slight dip in usage. Still, he remained a dominant fantasy force when active, posting a top-10 week during one-third of his outings (the league's fifth-highest rate). Hill has scored 36 touchdowns in 59 regular-season games and trails only Travis Kelce in target priority on Andy Reid's high-scoring, pass-heavy Chiefs offense led by Patrick Mahomes. Hill is a solid WR1 with added value in non-PPR formats.",
    "otherLeagueDraftValue": 23.21
  },
  {
    "name": "DeAndre Hopkins",
    "position": "WR",
    "auctionPrice": 53,
    "totalPoints": 313.0,
    "average": 19.5625,
    "bio": "Hopkins was traded to the Cardinals during the offseason and will now operate as Kyler Murray's go-to target. A top-five fantasy WR in four of the past five seasons, Hopkins has averaged 10.5 targets per game during that span, which is a mark he should still be able to approach with Arizona. Murray is far from a finished product, but the Cardinals' offense finished 2019 strong with three-plus touchdowns in eight of their final 11 games -- and that was without one of the game's best receivers. At age 28, Hopkins remains an elite fantasy option and should be selected near the first/second-round turn.",
    "otherLeagueDraftValue": 48.33
  },
  {
    "name": "Calvin Ridley",
    "position": "WR",
    "auctionPrice": 21,
    "totalPoints": 309.0,
    "average": 20.6,
    "bio": "Ridley enters his third NFL season as Atlanta's No. 2 wide receiver behind Julio Jones. The 2018 first-round pick impressed during his first two campaigns, catching 69% of his passes and averaging a healthy 8.0 YPT. Ridley took a step forward last season and actually had one of the highest floors in fantasy, finishing 27th or better during nine of his 13 outings. He sat 14th at the position in fantasy points prior to Week 14's season-ending abdomen injury. Especially with Mohamed Sanu and Austin Hooper gone, Ridley's role as Matt Ryan's No. 2 target is safe. The 25-year-old is a fringe top-20 fantasy receiver.",
    "otherLeagueDraftValue": 27.05
  },
  {
    "name": "Justin Jefferson",
    "position": "WR",
    "auctionPrice": 1,
    "totalPoints": 299.0,
    "average": 18.6875,
    "bio": "Minnesota used the 22nd pick of April's draft to select Jefferson ' the de facto replacement for Stefon Diggs. Jefferson is 6-foot-1, 202 pounds with outstanding ball skills and contested-catch ability. The former LSU Tiger also has decent wheels (4.43 40), though he doesn't stand out in terms of perimeter separation or against press, which helps explain why he aligned in the slot 90% of the time in 2019. With only Adam Thielen ahead of him on the depth chart, Jefferson won't be short of playing time as a rookie, which isn't new for the player who paced the FBS with 111 receptions in 2019. Jefferson's 83% catch rate and 18 touchdowns were best in this year's rookie class. Jefferson's short-term upside will be limited by Minnesota's run-heavy offense, but he's still worth a late-round pick.",
    "otherLeagueDraftValue": 3.3
  },
  {
    "name": "DK Metcalf",
    "position": "WR",
    "auctionPrice": 19,
    "totalPoints": 285.0,
    "average": 17.8125,
    "bio": "Metcalf is entering his second NFL season, following an impressive rookie campaign in which he played on 83% of Seattle's snaps and was responsible for 30% of the team's air yards. Metcalf scored seven touchdowns, but was actually unlucky in that department (8.1 OTD), as the Ole Miss product paced the entire NFL in end-zone targets -- his 19 looks were three more than any other player. Metcalf ended the season as fantasy's No. 33 WR, though his role resulted in only one top-12 fantasy week and seven finishes of 40th or worse. Metcalf is only 22 and good bet for a step forward in his second season. Consider him as a WR3 with the upside for a major breakout.",
    "otherLeagueDraftValue": 44.06
  },
  {
    "name": "Allen Robinson II",
    "position": "WR",
    "auctionPrice": 18,
    "totalPoints": 272.0,
    "average": 17.0,
    "bio": "It took a while following a lost 2017 due to a torn ACL and a transition to Chicago in 2018, but Robinson has finally reestablished himself as one of the game's top receivers. Last season, Robinson paced all wide receivers in snaps while ranking no lower than sixth in routes, targets, receptions and end-zone targets. A lack of post-catch production (2.6 RAC) limited Robinson's yardage, but he still managed his second career top-eight fantasy campaign. Robinson enters his age-27 season without a reliable quarterback, but he is in his prime with a generous target share. Consider him to be a solid WR2.",
    "otherLeagueDraftValue": 28.12
  },
  {
    "name": "Tyler Lockett",
    "position": "WR",
    "auctionPrice": 24,
    "totalPoints": 265.0,
    "average": 16.5625,
    "bio": "The 2019 season was Lockett's fifth in the NFL, but his first as Seattle's clear No. 1 wide receiver. It's safe to say he handled himself well, playing through a midseason injury and reaching career-high marks in targets, receptions and yardage. Whereas teammate DK Metcalf paced the NFL in end-zone targets, Lockett finished fourth with 13. Lockett has finished second in catch rate and no lower than 16th in fantasy points both of the past two seasons. His 18 touchdowns are second most at the position during that span. Lockett enters his age-27 season as one of the game's most-efficient receivers and Russell Wilson's top target. He's a solid WR2.",
    "otherLeagueDraftValue": 31.66
  },
  {
    "name": "A.J. Brown",
    "position": "WR",
    "auctionPrice": 26,
    "totalPoints": 259.0,
    "average": 18.5,
    "bio": "Brown is entering his second NFL season after quite the roller-coaster rookie campaign. Following a boom/bust first couple of months, the second-round pick peaked after the Titans' Week 11 bye, posting the second-most fantasy points and four top-10 weeks from that point forward. His five top-10 outings for the season trailed only Michael Thomas for the league high. Brown then crashed back to earth in the playoffs with a mere 64 yards in three games. The inconsistency was frustrating, but Brown appears to be the real deal. His 12.5 YPT and 9.0 RAC both topped the position and he dropped only one of his 84 targets. Brown's TD rate will regress (8 TD, 3.7 OTD), but a boost in volume is probable in Year 2. Consider Ryan Tannehill's top weapon to be a fringe WR2 with upside.",
    "otherLeagueDraftValue": 25.76
  },
  {
    "name": "Keenan Allen",
    "position": "WR",
    "auctionPrice": 22,
    "totalPoints": 252.0,
    "average": 18.0,
    "bio": "Allen enters his eighth NFL season in unfamiliar territory. The 2013 third-round pick has been targeted 758 times in his career -- and 751 of them have come from the hand of Philip Rivers. Rivers, who is now with the Colts, has helped Allen to top-13 finishes in targets, receptions, receiving yards and fantasy points in each of the past three seasons. Even with Rivers, Allen is coming off a very boom/bust fantasy campaign in which he was a top-20 WR in half of his outings, but outside the top 30 during the other half. Allen is still in his prime at age 28 and hasn't missed a game since 2016, but he hasn't scored more than six TDs in any season since 2013. The uncertainty of the Chargers' quarterback situation is a red flag, so Allen is best viewed as a WR2.",
    "otherLeagueDraftValue": 39.31
  },
  {
    "name": "Mike Evans",
    "position": "WR",
    "auctionPrice": 41,
    "totalPoints": 250.0,
    "average": 15.625,
    "bio": "Evans returns as Tampa Bay's top perimeter wide receiver. However, for the first time since his rookie season in 2014, Jameis Winston won't be his primary quarterback. That may not seem ideal after Evans put together four consecutive seasons as a top-17 fantasy WR, but it's very possible that the 26-year-old's efficiency and consistency will actually improve with Tom Brady in town. Evans has ranked near the top of the league in aDOT and YPR throughout his career, but near the basement in both catch rate and RAC. That has led to inconsistent production, including 2019, when 53% of his fantasy point total for the season came during just three games. Even if the big plays are down a bit, Evans will see enough volume and goal-line work (he's never finished lower than ninth in end-zone targets) to reach his third top-10 fantasy campaign.",
    "otherLeagueDraftValue": 5.21
  },
  {
    "name": "Amari Cooper",
    "position": "WR",
    "auctionPrice": 38,
    "totalPoints": 250.0,
    "average": 15.625,
    "bio": "Cooper re-signed with the Cowboys during the offseason and returns as Dak Prescott's top target. In 2019, Cooper produced his fourth 1,000-yard season in five tries while setting career-best marks in receiving yards, touchdowns and fantasy points in his first full campaign with Dallas. Incredibly, Cooper has yet to finish a season higher than 10th in fantasy points but, in five seasons, he has managed to post four 1,000-yard seasons and three seasons in a row with seven-plus TDs. He also has finished among the top receivers in catch rate and YPT for the past two seasons. Cooper doesn't get the same amount of targets of other top-end WRs, but the 26-year-old's top-end talent -- and Dallas' high-scoring offense --secures his spot as a strong WR2.",
    "otherLeagueDraftValue": 13.44
  },
  {
    "name": "Adam Thielen",
    "position": "WR",
    "auctionPrice": 26,
    "totalPoints": 247.0,
    "average": 16.466666666666665,
    "bio": "Following the offseason trade of Stefon Diggs to Buffalo, Thielen enters 2020 as the Vikings' clear-cut top target. Thielen missed six games because of injury last season, but was previously extremely reliable, having not missed a single game during his first five seasons. A top-10 fantasy WR in both 2017 and 2018, Thielen sat ninth prior to his Week 7 injury in 2019. Thielen turns 30 this year and Minnesota's run-heavy offense will limit his ceiling, but he's a safe bet for a generous target share and thus, a high fantasy floor. Grab him as your WR2.",
    "otherLeagueDraftValue": 24.11
  },
  {
    "name": "Robert Woods",
    "position": "WR",
    "auctionPrice": 20,
    "totalPoints": 243.0,
    "average": 15.1875,
    "bio": "Woods doesn't get the headlines, but the 2013 second-round pick has emerged as the high-scoring Rams' No. 1 wide receiver. A top-15 fantasy WR in both of the past two seasons, Woods was targeted nine-plus times in 10 of his 15 games last season. That 67% rate was tied with DJ Moore for fifth best in the league. Woods isn't going to get you many touchdowns, as he's never been above six in a season and saw only two end-zone targets last season. Still, he's a strong bet to push for 130 targets for the third consecutive season. Especially with Brandin Cooks gone, Woods is a fine WR2 target in PPR leagues.",
    "otherLeagueDraftValue": 6.72
  },
  {
    "name": "Brandin Cooks",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 238.0,
    "average": 15.866666666666667,
    "bio": "Cooks was traded to the Texans during the offseason and will compete for targets with Will Fuller V, Randall Cobb and Kenny Stills. At 26, Cooks is still in his prime, but has already been traded three times. Despite the constant movement, he has finished four of the past five seasons as a top-15 fantasy WR. Primarily a vertical threat, Cooks ranked no lower than ninth in YPT in the three seasons prior to an injury-plagued 2019 campaign with the Rams. Concussions are an ongoing concern for Cooks, but, if healthy, he's in good shape as one of Deshaun Watson's top targets. He should be on your flex radar, though there's certainly WR2 upside to be found here.",
    "otherLeagueDraftValue": 1.52
  },
  {
    "name": "Terry McLaurin",
    "position": "WR",
    "auctionPrice": 15,
    "totalPoints": 235.0,
    "average": 15.666666666666666,
    "bio": "Washington drafted McLaurin in the second round of the 2019 draft and it took the Ohio State product just one game to solidify himself as the team's top offensive weapon. McLaurin went on to miss a pair of games due to injury, but ranked 17th in fantasy points during the 14 weeks in which he was active. McLaurin was a bit over his head in the touchdown department (7 TD, 5.8 OTD), but saw a healthy 10 end-zone targets (11th most in the NFL) and his 10.0 YPT was ninth best. The 24-year-old is second-year QB Dwayne Haskins' go-to target and a fringe WR2 in fantasy.",
    "otherLeagueDraftValue": 17.0
  },
  {
    "name": "Robby Anderson",
    "position": "WR",
    "auctionPrice": 2,
    "totalPoints": 233.0,
    "average": 14.5625,
    "bio": "Following four seasons with the Jets, Anderson signed with Carolina during the offseason. Anderson went undrafted in 2016, but went on to appear in 62 of 64 games with New York, hauling in 206 passes for 3,034 yards and 20 touchdowns. Anderson was limited to one strong fantasy campaign (18th in 2017) and finished 39th and 40th in the past two seasons. In Anderson's defense, a position-high 33% of balls thrown his direction were 'off target' last season. In Carolina, the 26-year-old vertical threat will work alongside DJ Moore and Curtis Samuel in Matt Rhule's new-look offense led by QB Teddy Bridgewater. Consistency is unlikely with Christian McCaffrey as the focal point of the Panthers' offense, so Anderson is safest as a borderline flex play in deeper leagues.",
    "otherLeagueDraftValue": 15.6
  },
  {
    "name": "DJ Moore",
    "position": "WR",
    "auctionPrice": 22,
    "totalPoints": 227.0,
    "average": 15.133333333333333,
    "bio": "The first wide receiver selected in the 2018 draft, Moore flashed with a 55-788-2 receiving line as a rookie before enjoying a full-on breakout in 2019. Moore finished as a top-10 WR in routes, targets, receptions and receiving yards. Moore's efficiency has been outstanding, as he has dropped just three of 215 career targets, while dominating with the ball in his hands (5.7 RAC). The one drawback has been a lack of scoring (six career TDs, 8.2 OTD), which has limited his ceiling. He managed only two weekly finishes better than 13th and was fantasy's No. 16 WR in 2019. Moore will have new QB Teddy Bridgewater and new coach Matt Rhule this season, but the 23-year-old's heavy usage is unlikely to change, though perhaps he'll see more goal-line work. He's a fringe WR1.",
    "otherLeagueDraftValue": 3.65
  },
  {
    "name": "Marvin Jones Jr.",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 227.0,
    "average": 14.1875,
    "bio": "Jones, Kenny Golladay and Danny Amendola played 12 games together last season. The target breakdown in those weeks were as follows: Jones had 86 (20% share), Golladay had 85 (20%), and Amendola saw 78 (18%). When Jones was out during Weeks 15-17, Golladay only edged Amendola 23-20 (24%-21%) in that category. This trio is probably closer than you realize in usage, which may lead to Jones being undervalued in fantasy again. He's now 30, but Jones has scored nine touchdowns in two of the past three seasons and was on pace for nine in 2018 prior to an injury. He finished 14th, 27th and 20th in fantasy points per game during that span.",
    "otherLeagueDraftValue": 0.78
  },
  {
    "name": "Cole Beasley",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 222.0,
    "average": 14.8,
    "bio": "Beasley wanted a bigger piece of the pie and he certainly got it in his first season in Buffalo. The undersized slot man set career highs in targets (104) and touchdowns (6) en route to a WR34 finish in fantasy. Despite a generous 19% target share, Beasley's low ceiling remained a problem, as he managed only three weekly finishes better than 26th. Strictly a short-area target, Beasley has finished every season of his career in the 11th percentile or lower in aDOT, and his 2.9 OTD suggests he's headed for regression in the touchdown department. Buffalo's trade for Stefon Diggs will cost Beasley plenty of targets, so the 31-year-old can only be viewed as a low-ceiling bench option in deep PPR leagues.",
    "otherLeagueDraftValue": 0.75
  },
  {
    "name": "Diontae Johnson",
    "position": "WR",
    "auctionPrice": 2,
    "totalPoints": 219.0,
    "average": 14.6,
    "bio": "All things considered, Johnson had a pretty darn impressive rookie season. The 2019 third-round pick was a part-time player for most of the season, but still managed a solid 59-680-5 receiving line on his way to a 39th-place finish in fantasy points. That success came despite his operating in an offense with extremely poor quarterback play. That's unlikely to be an issue again in 2020 with Ben Roethlisberger back from injury. Johnson joins up with JuJu Smith-Schuster, James Washington and rookie Chase Claypool to form one of the league's top young WR groups. Roethlisberger has supported three fantasy-relevant WRs in the past, so it's certainly possible for multiple receivers to shine in Pittsburgh's pass-heavy offense. Consider Johnson as a flex target with upside.",
    "otherLeagueDraftValue": 2.89
  },
  {
    "name": "Cooper Kupp",
    "position": "WR",
    "auctionPrice": 29,
    "totalPoints": 218.0,
    "average": 14.533333333333333,
    "bio": "Kupp is a very tricky evaluation following a bizarre 2019 campaign that can be split into two distinct parts. During Weeks 1-12, Kupp played on 87% of snaps and handled a 25% target share. With Tyler Higbee taking on a larger role during Weeks 13-17, those rates dropped to 63% and 15%, respectively. Kupp still ended up fourth in fantasy points due to the strong start and an unsustainable level of touchdown production (10 TD, 5.6 OTD), but we can't overlook the Rams' scheme change in December. The departure of Brandin Cooks definitely helps, but Kupp is now safest-viewed as a mid-to-back-end WR2.",
    "otherLeagueDraftValue": 12.43
  },
  {
    "name": "JuJu Smith-Schuster",
    "position": "WR",
    "auctionPrice": 35,
    "totalPoints": 216.0,
    "average": 13.5,
    "bio": "Smith-Schuster enters 2020 looking to bounce back after a rough 2019 season marred by Ben Roethlisberger's season-ending injury in Week 2, as well as various injuries of his own. After pacing all wide receivers in routes run and finishing top 10 in targets, receptions, receiving yards, end-zone targets and fantasy points during a breakout 2018 campaign, Smith-Schuster was held to a 41-542-3 line in 12 games of \"QB purgatory\" last season. Smith-Schuster is still only 23 years old and a strong bet for a rebound season with Roethlisberger back in action. Consider him to be a WR2 with upside.",
    "otherLeagueDraftValue": 3.45
  },
  {
    "name": "CeeDee Lamb",
    "position": "WR",
    "auctionPrice": 1,
    "totalPoints": 216.0,
    "average": 13.5,
    "bio": "Dallas selected Lamb with the 17th pick of April's draft. The Oklahoma product is fresh off a dominant 2019 campaign, in which he averaged 14.3 yards per target, 4.0 yards per route run and 11.1 yards after the catch ' all of which were best in this year's rookie class. Lamb is lean (198 pounds) but tall (6-foot-2) with solid speed (4.50 40-yard dash), as well as terrific separation and post-catch ability. Lamb is in and Randall Cobb out behind Amari Cooper and Michael Gallup, and so, while being third in line will limit Lamb's upside, note that all three 2019 Cowboys receivers were top 31 in fantasy points during 13 full weeks together. Add in Mike McCarthy's history of heavy reliance on three-wide sets and Lamb could flirt with flex value. He is a worth a late-round pick.",
    "otherLeagueDraftValue": 1.28
  },
  {
    "name": "Chase Claypool",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 211.0,
    "average": 13.1875,
    "bio": "Pittsburgh drafted Claypool in the second round of April's draft. Claypool is a huge (6-foot-4, 238 pounds) and physical receiver with terrific speed (4.42 40-yard dash) and playmaking ability. The Notre Dame product's NFL role has yet to be determined, as he has experience as a perimeter receiver, but some teams also preferred him at tight end. Regardless, Claypool is unlikely to find his way to short-term fantasy value with JuJu Smith-Schuster, Diontae Johnson and James Washington ahead of him on the depth chart. He doesn't need to be drafted in 2020 leagues.",
    "otherLeagueDraftValue": 7.16
  },
  {
    "name": "Curtis Samuel",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 211.0,
    "average": 14.066666666666666,
    "bio": "Samuel's career advanced another step last season as the 2017 second-round pick appeared in 16 games for the first time in his career and posted career-high totals in receptions, receiving yards and touchdowns. His efficiency wasn't good (51% catch rate, 5.9 YPT), although some of that can be blamed on a 28% off-target rate (eighth highest in the NFL). Samuel did finish as 2019's No. 26 fantasy WR, thanks in part to his also being a factor as a rusher (19-130-1 on the ground). He is sure to sustain a significant role in Matt Rhule's new-look offense, but Carolina's signing of Robby Anderson is sure to cost Samuel targets. As such, he's only a flex option in deeper leagues.",
    "otherLeagueDraftValue": 0.18
  },
  {
    "name": "Corey Davis",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 210.0,
    "average": 15.0,
    "bio": "Davis is entering his fourth NFL season having yet to emerge as a go-to target after being drafted with the fifth overall pick of the 2017 draft. Davis did take a bit of a leap with a 65-891-4 receiving line in 2018, but plummeted to 43-601-2 last season as then-rookie A.J. Brown took over as the Titans' No. 1 receiver. Despite standing 6-foot-3, Davis has scored a grand total of six touchdowns in three seasons. The 25-year-old could still make a leap forward, but he's a long shot for consistent fantasy value in Tennessee's run-heavy scheme.",
    "otherLeagueDraftValue": 0.64
  },
  {
    "name": "Will Fuller V",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 209.0,
    "average": 19.0,
    "bio": "The Texans traded away DeAndre Hopkins during the offseason, which should vault 2016 first-round pick Fuller to a full-on fantasy breakout. The problem, of course, is that Fuller is entering his fifth NFL season having already missed 34% of his team's games because of injury. That number includes five games last season. The good news is that, when healthy, Fuller has been heavily targeted and productive. In nine full games last season, he handled 7.7 targets per game (a 25% share) and trailed Hopkins by only nine total targets. He was fantasy's No. 13 WR in those weeks. It's hard to expect a full season from the oft-injured receiver, but Fuller undoubtedly still has massive upside. The 26-year-old is best viewed as a flex.",
    "otherLeagueDraftValue": 8.95
  },
  {
    "name": "Tyler Boyd",
    "position": "WR",
    "auctionPrice": 3,
    "totalPoints": 195.0,
    "average": 13.0,
    "bio": "Boyd seemed like a total bust through his first two seasons in the league, but the Bengals' slot man has completely shed that label with a pair of top-18 fantasy campaigns. With A.J. Green sidelined last season, Boyd finished no lower than eighth among receivers in snaps, routes run, targets and receptions. Weak quarterback play led to underwhelming efficiency numbers, but it's very possible that will improve with No. 1 overall pick Joe Burrow under center. Boyd isn't going to get you many TDs (12 TD, 7.7 OTD, 7 end zone targets over the past two seasons) and his targets will take a slight hit with the combination of Green's return and rookie Tee Higgins joining the fold. Still, the 25-year-old short-area weapon will rack up plenty of catches. Consider Boyd to be a fine WR3 in PPR formats.",
    "otherLeagueDraftValue": 6.54
  },
  {
    "name": "Tee Higgins",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 191.0,
    "average": 11.9375,
    "bio": "The Bengals selected Higgins with the 33rd pick of April's draft. Higgins checks in at 6-foot-4, 216 pounds and has drawn comparisons to new teammate A.J. Green due to his frame, catch radius and terrific ball skills. The Clemson product profiles as a perimeter receiver (19% slot last season) who will do a lot of his damage downfield (14.6 aDOT) and near the goal line. Higgins averaged 3.8 yards per route run in 2019, which was second-best in this year's rookie class. Higgins has the talent to eventually emerge as a fantasy force (and perhaps even Joe Burrow's top target), but it might take some time for him to see the field, with Green, Tyler Boyd and John Ross also on the 2020 depth chart. He's barely worth a late-round pick in 2020 leagues.",
    "otherLeagueDraftValue": 2.99
  },
  {
    "name": "Nelson Agholor",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 191.0,
    "average": 11.9375,
    "bio": "",
    "otherLeagueDraftValue": 0.04
  },
  {
    "name": "Brandon Aiyuk",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 184.0,
    "average": 15.333333333333334,
    "bio": "San Francisco selected Aiyuk with the 25th pick of April's draft. Aiyuk comes in at 6-foot, 205 pounds with 4.50 40-yard speed, as well as terrific explosiveness and route-running ability. The Arizona State product's best asset is his post-catch production (10.5 RAC in 2019), which helped him to plenty of big plays at ASU. Aiyuk doesn't have a ton of competition for early-career snaps, but he should be considered a long shot for weekly fantasy value in a super-run-heavy 49ers' offense that will lean heavily on George Kittle and Deebo Samuel. He's worth only a late-round pick.",
    "otherLeagueDraftValue": 0.42
  },
  {
    "name": "Chris Godwin",
    "position": "WR",
    "auctionPrice": 41,
    "totalPoints": 183.0,
    "average": 15.25,
    "bio": "Godwin is entering his fourth NFL season and his second as a full-time player. His first season as a full-timer went, in a word, well. Inexplicably a situational player under Dirk Koetter, Godwin finished 2019 ranked as a top-10 WR in snaps, routes, yardage and touchdowns. He finished fourth at the position in catch rate (72%) and RAC (6.6) and was first in first-down rate (50%). Godwin is a candidate for touchdown regression (9 TD, 5.1 OTD) in 2020 and will have a new quarterback in Tom Brady, but the 24-year-old appears to be the real deal. Consider him as a solid WR1.",
    "otherLeagueDraftValue": 14.12
  },
  {
    "name": "Jarvis Landry",
    "position": "WR",
    "auctionPrice": 9,
    "totalPoints": 181.0,
    "average": 12.066666666666666,
    "bio": "Landry was expected to see a big dip in production last season following the Browns' trade for Odell Beckham Jr. Instead, Cleveland's slot man had one of his best NFL seasons and actually out-targeted his teammate 139-132. Landry set a career-high in receiving yardage (1,174) and YPR (14.1) en route to his fifth consecutive top-18 fantasy campaign. Landry has proved to be super reliable, having never missed a game in six seasons and checking in as one of just six players who were targeted in 100% of his 2019 games. New coach Kevin Stefanski could shake things up a bit, but Landry's connection with Baker Mayfield is solid, making him a fine WR3 target.",
    "otherLeagueDraftValue": 0.63
  },
  {
    "name": "Jamison Crowder",
    "position": "WR",
    "auctionPrice": 1,
    "totalPoints": 178.0,
    "average": 14.833333333333334,
    "bio": "Crowder has emerged as one of the game's top slot/short-area targets and that skill was on full display in his first season with the Jets. The longtime slot man in Washington posted a healthy 78-833-6 receiving line in New York, leading to a 26th-place finish in fantasy points. Crowder finished near the basement of the position in aDOT (8.1) for the fifth time in as many seasons, which limited big plays (6.8 YPT), but allowed him to soak up receptions (16th most). At 5-foot-8, 185 pounds, Crowder won't get you many touchdowns. Heck, he has only 20 career end zone targets. Still, Sam Darnold's top option will catch enough passes to allow for flex production in PPR leagues.",
    "otherLeagueDraftValue": 15.35
  },
  {
    "name": "Marquise Brown",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 177.0,
    "average": 11.0625,
    "bio": "Baltimore selected Brown in the first round of the 2019 draft and the speedster was immediately slotted in as the team's top wide receiver by default. Brown's boom/bust rookie campaign began with his best game in Week 1 (4-147-2) followed by mixed results (including a pair of missed games) the rest of the way. Brown ended up as the WR46 on the season, thanks to seven touchdowns on 69 targets. His 10.1% TD rate was second highest at the position and certainly unsustainable. Brown is an obvious bet for a boost in targets in his second season as Lamar Jackson's top perimeter target. The 23-year-old is a breakout candidate and a sharp flex target.",
    "otherLeagueDraftValue": 6.8
  },
  {
    "name": "Russell Gage",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 175.0,
    "average": 10.9375,
    "bio": "Gage is an intriguing deep sleeper this season after the Falcons failed to address the WR position during free agency and the draft. The 2018 sixth-round pick was promoted to slot duties in Atlanta's pass-heavy offense last season following the trade of Mohamed Sanu. Counting only weeks in which Julio Jones and Calvin Ridley also played, Gage handled a 16% target share and was the WR40 for fantasy. Especially with Austin Hooper no longer in the fold, Gage is well-positioned for a similar role in his third NFL season. Consider him late in deep PPR leagues.",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "DeVante Parker",
    "position": "WR",
    "auctionPrice": 6,
    "totalPoints": 172.0,
    "average": 12.285714285714286,
    "bio": "It's not often that a player realizes his potential in his fifth NFL season, but that was exactly what happened for Parker last season. After failing to post a single top-50 campaign while totaling nine touchdowns during his first four seasons in Miami, Parker exploded for a 72-1,202-9 receiving line in his first year working with Brian Flores. He ended up as fantasy's No. 11 WR and finished top five in routes run, receiving yards and touchdowns. The 27-year-old has first-round pedigree and had suffered through several injuries, so the leap wasn't a major shock, but we also should proceed with caution in 2020. Miami's top offensive target is safest when targeted as a WR3.",
    "otherLeagueDraftValue": 1.74
  },
  {
    "name": "Michael Gallup",
    "position": "WR",
    "auctionPrice": 6,
    "totalPoints": 172.0,
    "average": 10.75,
    "bio": "Most would agree that Gallup is the Cowboys' No. 2 wideout behind Amari Cooper, but it's not as clear-cut as you might think. In 13 full games together last season, Gallup played on 44 more snaps and was targeted four more times than his counterpart. Both were top-10 fantasy receivers during those weeks. Gallup looks like the real deal following a breakout second season in which he posted a 66-1,107-6 receiving line and ranked ninth among wide receivers with a 16.8 YPR. The 24-year-old has solidified himself as one of Dak Prescott's go-to targets and, even though his workload could drop slightly with CeeDee Lamb in the mix, he could make up for some of that with more usage near the goal line. He had only three end-zone targets last season. Consider Gallup as a borderline WR3.",
    "otherLeagueDraftValue": 0.11
  },
  {
    "name": "Jerry Jeudy",
    "position": "WR",
    "auctionPrice": 6,
    "totalPoints": 163.0,
    "average": 10.1875,
    "bio": "Denver selected Jeudy with the 15th pick of April's draft. The Alabama product sports a 6-foot-1, 193-pound frame and is extremely versatile, having shown the ability to produce on all levels, as well as in the slot (69% in 2019) and on the perimeter. Jeudy is fast (4.45 40-yard dash), agile and a quality route-runner. Jeudy slots in behind Courtland Sutton but has little competition for snaps otherwise and should be an every-down player out of the gate. Jeudy has WR1 upside down the road but should be viewed as a shaky flex option for 2020 in a run-heavy Broncos offense and with Drew Lock still an unknown.",
    "otherLeagueDraftValue": 0.94
  },
  {
    "name": "Tim Patrick",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 163.0,
    "average": 10.866666666666667,
    "bio": "",
    "otherLeagueDraftValue": 0.57
  },
  {
    "name": "T.Y. Hilton",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 159.0,
    "average": 10.6,
    "bio": "Hilton enters 2020 looking for a rebound following what was essentially a lost season. As if Andrew Luck's shocking August retirement wasn't enough, injuries limited Hilton to only 10 games and a situational role in the second half of the campaign. Hilton was still effective when healthy, ranking 13th in fantasy points during the six weeks he was active prior to Week 9. Hilton is now 30 years old, but has generally held up well, missing only four games during his first seven seasons. He will now have Philip Rivers throwing him passes. Hilton was a top-27 fantasy WR during each of his first seven seasons and remains very much in the WR2 discussion for 2020.",
    "otherLeagueDraftValue": 0.47
  },
  {
    "name": "Emmanuel Sanders",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 157.0,
    "average": 11.214285714285714,
    "bio": "Sanders is now 33, but the veteran receiver is well-situated for another season of fantasy relevance after signing with the high-scoring Saints. Sanders is no longer the target hog he was during his prime, but he has nonetheless managed a pair of top-30 fantasy campaigns over the past two seasons. Sanders has seen top-10 finishes in catch rate in both of the past two seasons and figures to work as one of Drew Brees' top targets in the short-to-intermediate area behind Michael Thomas. Sanders is unlikely to be a major asset near the goal line, as he has cleared six touchdowns in a season just once in his career. Nevertheless, he'll see enough volume to warrant weekly flex consideration.",
    "otherLeagueDraftValue": 0.81
  },
  {
    "name": "Sterling Shepard",
    "position": "WR",
    "auctionPrice": 1,
    "totalPoints": 156.0,
    "average": 13.0,
    "bio": "Shepard has been a tricky player to figure out so far. The 2016 second-round pick has finished two seasons among the top-eight WRs in routes run, but he's also missed five-plus games in two different seasons and he's yet to finish any season better than No. 30 in fantasy points. Shepard replaced Odell Beckham Jr. as the Giants' No. 1 WR last season -- and he was very busy, handling six-plus targets during all 10 appearances. Only five other players can say the same. Shepard's efficiency was poor, but the volume allowed him the 17th-most fantasy points during those 10 weeks. Shepard will have more competition with a healthier group around him this season, but he's still a legitimate candidate to lead the team in targets. Don't sleep on the 26-year-old when flex hunting.",
    "otherLeagueDraftValue": 0.94
  },
  {
    "name": "Mike Williams",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 155.0,
    "average": 10.333333333333334,
    "bio": "Slowly but surely, Williams' pro career continues to progress. The 2017 first-round pick barely played as a rookie, posting a 43-664-10 receiving line in a situational role in 2018. He followed that up with a 49-1,001-2 line as a full-time player in 2019. Last season, Williams paced the NFL in aDOT (17.3) and YPR (20.4) and ranked fourth in YPT (11.0), but dealt with the worst luck in the league in the touchdown department. Williams posted a 6.9 OTD thanks to 11 end-zone targets (tied for eighth most), but scored only twice. The 25-year-old is a strong bet for more touchdowns, but the departure of Philip Rivers hurts his stock. Williams is a more appealing flex choice in non-PPR leagues.",
    "otherLeagueDraftValue": 1.81
  },
  {
    "name": "Julio Jones",
    "position": "WR",
    "auctionPrice": 56,
    "totalPoints": 154.0,
    "average": 17.11111111111111,
    "bio": "Jones is now 31 years old but remains an elite fantasy weapon as Matt Ryan's top target in the pass-heavy Atlanta offense. Jones continues to underwhelm in the touchdown department (only 6.2 scores per season since 2014), but he more than makes up for it with both massive targets (10.5 per game over the past two seasons) and receiving yardage (ranked among the top three WRs in each of the past six seasons). Jones' career-low YPT and RAC marks last season are a slight concern for a player now in his 30s, but his heavy usage positions him well for a run at a seventh straight top-seven fantasy campaign. Draft him in the second round.",
    "otherLeagueDraftValue": 33.84
  },
  {
    "name": "DJ Chark Jr.",
    "position": "WR",
    "auctionPrice": 12,
    "totalPoints": 151.0,
    "average": 11.615384615384615,
    "bio": "Chark entered 2019 with little fanfare, despite the fact that he was a second-round pick entering his second NFL season and positioned for a significant boost in playing time. It didn't take long for the former LSU star to get noticed. Despite Jacksonville's offensive dysfunction, Chark posted a 73-1,008-8 receiving line. His 12 end-zone targets (over 15 contests) tied for fifth most in the league and only 16 receivers scored more fantasy points. Chark is 23 years old with the size and speed to sustain top-tier production. With Gardner Minshew entering his second season and Jay Gruden perhaps adding a spark to the offense, Chark has the look of a good WR3 with upside.",
    "otherLeagueDraftValue": 3.15
  },
  {
    "name": "Keelan Cole Sr.",
    "position": "WR",
    "auctionPrice": 0,
    "totalPoints": 147.0,
    "average": 9.1875,
    "bio": "",
    "otherLeagueDraftValue": 0.51
  },
  {
    "name": "Darius Slayton",
    "position": "WR",
    "auctionPrice": 1,
    "totalPoints": 144.0,
    "average": 9.0,
    "bio": "In a performance that was eerily similar (albeit not quite as dominant) to the one of the man he helped replace (Odell Beckham Jr.), Slayton missed the first two games of his rookie season before bursting onto the fantasy scene with eight touchdowns in 14 games. Slayton was on the field for 77% of the Giants' pass plays and was WR27 in fantasy points from Week 3 on. Slayton's touchdown rate is far from sustainable (3.5 OTD), but the 2019 fifth-round pick will enter his second season as New York's primary vertical threat. The New York offense has a lot of mouths to feed, but there's certainly a window for Slayton to become the team's No. 1 wideout. Slayton is safest as a flex in deeper leagues.",
    "otherLeagueDraftValue": 0.9
  },
  {
    "name": "Travis Kelce",
    "position": "TE",
    "auctionPrice": 32,
    "totalPoints": 325.0,
    "average": 21.666666666666668,
    "bio": "Kelce enters the 2020 season attempting to pace all tight ends in fantasy points for the fifth consecutive season. Is that good? It seems good. Kelce continued his dominance last season by finishing as a top-13 fantasy TE every week other than 17. Kelce has finished no lower than second at the position in routes, targets, receptions and yardage each of the past three seasons. His touchdowns fell from 10 in 2018 to five in 2019, but his 7.3 OTD (second-highest) and nine end zone targets (fourth) suggest he was actually unlucky in that area. Kelce has never finished a season outside the top 10 in YPT and remains one of Patrick Mahomes' top targets. The 30-year-old is worth a look in Round 2.",
    "otherLeagueDraftValue": 41.94
  },
  {
    "name": "Darren Waller",
    "position": "TE",
    "auctionPrice": 4,
    "totalPoints": 292.0,
    "average": 18.25,
    "bio": "Waller's breakout 2019 season marked one of the most improbable breakout campaigns you'll ever see. Waller was drafted in the sixth round of the 2015 draft as a 6-foot-6 wide receiver. He barely saw the field while dealing with addiction but got back on his feet as a tight end with the Raiders. An absolute force from the get-go, Waller finished no lower than fourth among tight ends in snaps, routes, targets, receptions, yardage or YPT. Waller was held to three touchdowns (3.9 OTD) but finished third in fantasy points. The 27-year-old is Derek Carr's top target and positioned well for another high-volume season. He's a top-five fantasy tight end.",
    "otherLeagueDraftValue": 16.99
  },
  {
    "name": "Logan Thomas",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 168.0,
    "average": 10.5,
    "bio": "",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "T.J. Hockenson",
    "position": "TE",
    "auctionPrice": 1,
    "totalPoints": 161.0,
    "average": 10.0625,
    "bio": "It's rare for a rookie tight end to make much noise in fantasy, so Hockenson's 32-367-2 line after being selected eighth overall in the 2019 draft should not be viewed as a knock. The Iowa product showed his upside with a 6-131-1 showing in his NFL debut, but managed double-digit fantasy points in only one additional game and missed the final four games due to injury. The 23-year-old is a strong bet for more work in his second season and, as usual for second-year tight ends, will come fairly cheap in the double-digit rounds. Hockenson has the upside to become one of the next great all-around tight ends.",
    "otherLeagueDraftValue": 1.87
  },
  {
    "name": "Robert Tonyan",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 157.0,
    "average": 9.8125,
    "bio": "",
    "otherLeagueDraftValue": 0.52
  },
  {
    "name": "Mark Andrews",
    "position": "TE",
    "auctionPrice": 17,
    "totalPoints": 156.0,
    "average": 11.142857142857142,
    "bio": "A 2018 third-round pick, Andrews exited his rookie campaign seemingly set to become one of the league's next great tight ends. It's fair to say he delivered the goods in 2019. Despite ranking 40th at the position in snaps, Andrews handled a massive 25% target share for Baltimore's league-best offense en route to a TE5 fantasy campaign. Andrews' 11 end zone targets tied for most among tight ends and eighth in the entire league. That helped him to 10 touchdowns. Andrews' has ranked no lower than fifth in aDOT or YPR during his two pro seasons. Lamar Jackson's top target enters his age-24 season as a solid TE1 option.",
    "otherLeagueDraftValue": 13.49
  },
  {
    "name": "Mike Gesicki",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 153.0,
    "average": 10.2,
    "bio": "It was a rough 2019 season for the Dolphins, but that didn't stop Gesicki from quietly taking a big leap forward. The 2018 second-round pick finished the season third among tight ends in pass routes and ranked no lower than 12th in targets, receptions, receiving yards or touchdowns. Gesicki's 11 end zone targets tied for most among tight ends and eighth in the entire league. His 58% catch rate was ugly, but his role as a seam-stretcher (10.1 aDOT) and shaky quarterback accuracy (22% off target rate) were the primary culprits. Gesicki has yet to drop a pass on 120 targets and was fantasy's TE12 in 2019. He's a candidate for another leap forward and a borderline TE1 option.",
    "otherLeagueDraftValue": 0.25
  },
  {
    "name": "Rob Gronkowski",
    "position": "TE",
    "auctionPrice": 8,
    "totalPoints": 140.0,
    "average": 8.75,
    "bio": "Gronk is back! The longtime Patriots' superstar ended his retirement and was traded to the Buccaneers, where he'll reunite with his former quarterback Tom Brady. Gronkowski sat out last season after ending 2018 with his seventh fantasy finish of 11th or better in nine NFL seasons. When healthy, effectiveness has never been an issue for Gronkowski (he has never played a season in which he was lower than seventh among tight ends in yards per target or yards per reception), but durability has been an issue (he hasn't appeared in a full 16-game regular season since 2011).'Gronkowski is unlikely to re-emerge as an elite fantasy option, but he's in a good enough situation to allow mid-to-back-end TE1 numbers.",
    "otherLeagueDraftValue": 2.75
  },
  {
    "name": "Noah Fant",
    "position": "TE",
    "auctionPrice": 1,
    "totalPoints": 138.0,
    "average": 9.2,
    "bio": "The Broncos selected Fant in the first round of last year's draft and proceeded to put him on the field for 68% of their offensive snaps. That's a healthy number for a 21-year-old rookie, as was Fant's TE16 fantasy campaign. The Iowa product was a game-changer with the ball in his hands, pacing 41 qualified tight ends with an 8.3 RAC. His 562 receiving yards rank sixth and his 8.9 YPT fifth among rookie tight ends since 2007. Fant's usage actually declined quite a bit in December, but there's little doubt he's a strong candidate for a big second-year leap as one of Drew Lock's top targets. Fant has elite upside and should be on your radar in the middle rounds.",
    "otherLeagueDraftValue": 2.43
  },
  {
    "name": "Dalton Schultz",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 137.0,
    "average": 8.5625,
    "bio": "",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Hunter Henry",
    "position": "TE",
    "auctionPrice": 2,
    "totalPoints": 136.0,
    "average": 9.714285714285714,
    "bio": "Henry is back with the Chargers after the team applied the franchise tag during the offseason. The team's 2016 second-round pick has yet to play a full 16-game season, missing all of 2018 and a total of seven games the other three seasons. That includes four in 2019, though Henry was productive enough when active to produce his first top-10 fantasy campaign. Henry has finished top-10 in YPT in all three of his NFL seasons and has been a force near the goal line, with 17 touchdowns and 25 end zone targets in 41 games. Henry's durability woes and the departure of Philip Rivers are concerns, but the 25-year-old will still be a back-end TE1 option when active.",
    "otherLeagueDraftValue": 2.0
  },
  {
    "name": "Hayden Hurst",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 136.0,
    "average": 8.5,
    "bio": "Hurst was traded to the Falcons following two seasons as a situational player in Baltimore. Atlanta will look to the 2018 first-round pick as a replacement for Austin Hooper. Hurst posted a modest 30-349-2 receiving line off the bench last season, but his efficiency was great. He ranked sixth at tight end in both catch rate (77%) and YPT (8.9). Hurst has yet to eclipse a 58% snap share in 30 career games, but he figures to operate as a full-time, two-way tight end in a pass-heavy Atlanta offense that helped Hooper to back-to-back TE1 campaigns. Hurst is obviously a bit risky, but the 26-year-old is well-positioned for a breakout. Consider him a mid-range TE2.",
    "otherLeagueDraftValue": 0.51
  },
  {
    "name": "Evan Engram",
    "position": "TE",
    "auctionPrice": 6,
    "totalPoints": 135.0,
    "average": 8.4375,
    "bio": "Engram is entering his fourth NFL season having missed 14 of 48 possible games due to injury, including five games in 2018 and eight last season. The injuries have held Engram without a top-12 fantasy campaign since 2017, but there's no doubt he's been a major force when healthy. Engram was one of six players who appeared in at least eight games and were targeted at least six times during 100% of those outings last season. The consistent usage helped him to five top-10 fantasy weeks in eight tries (the position's fourth-best rate). We have to knock him a bit for durability concerns, but Engram is still in his prime at age 25 and should be locked into lineups when active.",
    "otherLeagueDraftValue": 0.57
  },
  {
    "name": "Eric Ebron",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 131.0,
    "average": 8.733333333333333,
    "bio": "Ebron signed with the Steelers after spending the first six seasons of his career in Detroit and Indianapolis. The 2014 first-round pick underachieved during his time with the Lions, but a breakout season in 2018 saw him post a 66-750-13 receiving line. He crashed back to earth last season thanks to predictable regression to the mean, but also due to the loss of Andrew Luck, posting a 31-375-3 line in 11 games. Now with Pittsburgh, the 27-year-old figures to work ahead of Vance McDonald as the team's top receiving tight end. Ebron is best-viewed as a mid-to-back-end TE2.",
    "otherLeagueDraftValue": 0.98
  },
  {
    "name": "Jimmy Graham",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 130.0,
    "average": 8.125,
    "bio": "Graham signed with the Bears during the offseason following a pair of seasons with the division-rival Packers. The 33-year-old isn't the fantasy force he was during his prime years in New Orleans and Seattle and is coming off his worst statistical season since his rookie year. Graham played 55% of the snaps, handled a 12% target share and posted a 38-447-3 receiving line despite appearing in all 16 of Green Bay's regular-season games. Graham finished eighth at tight end in pass routes, but 21st in fantasy points. Graham figures to contribute as a seam-stretcher in Chicago, but he'll be a part-time player in an offense with a shaky quarterback situation. Consider him a back-end TE2.",
    "otherLeagueDraftValue": 0.55
  },
  {
    "name": "George Kittle",
    "position": "TE",
    "auctionPrice": 39,
    "totalPoints": 128.0,
    "average": 16.0,
    "bio": "Kittle wasn't much of a factor as a pass-catcher during the 49ers' Super Bowl run (8-71-0 in three games), but don't let that overshadow what was another dominant regular season. Kittle followed up his breakout 2018 season with an 85-1053-5 receiving line in 14 games in 2019. Kittle has finished no lower than fourth in targets, receptions, yardage, RAC or fantasy points each of the past two seasons. One area where Kittle has underwhelmed is touchdowns (five each of the past two seasons) and his 10.8 OTD and 13 end zone targets during the span suggest it's not a fluke. Of course, there's still plenty of room to grow in that department, and Kittle has plenty of dominant years left at age 26. He's a fine third-round target.",
    "otherLeagueDraftValue": 36.24
  },
  {
    "name": "Jonnu Smith",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 127.0,
    "average": 8.466666666666667,
    "bio": "With Delanie Walker out of the way, Smith enters his fourth NFL season finally locked in atop the Titans' depth chart. Granted it was on 43 targets, but Smith's 2019 season was highly efficient. He ranked no lower than second at the position in catch rate (81%), YPT (10.2) or RAC (7.9). The Titans appear committed to manufacturing touches for the versatile Smith, as 19% of his targets came on screens and he also handled four carries. Of course, the usage has yet to allow much fantasy success. Most of Smith's work has come near the line of scrimmage (5.7 aDOT) and very little has come near the end zone (eight touchdowns, six end zone targets in career). Smith is a back-end TE2.",
    "otherLeagueDraftValue": 4.01
  },
  {
    "name": "Jared Cook",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 118.0,
    "average": 7.866666666666666,
    "bio": "After failing to post a single fantasy campaign better than 12th during his first eight NFL seasons, Cook has posted a pair of top-seven finishes (and with different teams) over the past two seasons. Cook missed a pair of games last season, but managed a TE7 campaign thanks to nine touchdowns (his 11 end zone targets tied for most among tight ends and eighth in the league) and elite efficiency (he posted the position's highest aDOT, YPR and YPT). Cook is now 33 years old, but his role as one of Drew Brees' primary targets remains secure. Consider him a borderline top-10 fantasy option.",
    "otherLeagueDraftValue": 1.02
  },
  {
    "name": "Tyler Higbee",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 118.0,
    "average": 7.866666666666666,
    "bio": "If someone told you midway through the 2019 season that Higbee was a solid TE1 fantasy option going forward, you would've laughed. The 2016 fourth-round pick had totaled an 86-884-5 receiving line in 58 games through Week 12 of last season. He went on to produce a 43-522-2 line while averaging 11.4 targets per game the rest of the season. Higbee was the top-scoring fantasy TE by 23 points during the span. The 27-year-old signed a contract extension last year and Sean McVay's adjustment to more '12' personnel late last season suggests Higbee's emergence was no fluke. Higbee is best-viewed as mid-range TE1.",
    "otherLeagueDraftValue": 0.06
  },
  {
    "name": "Dallas Goedert",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 113.0,
    "average": 10.272727272727273,
    "bio": "Goedert spent the 2019 season behind Zach Ertz on the depth chart and missed a game, but still managed a top-10 finish among tight ends in targets, receptions, yardage, touchdowns and fantasy points. A big reason for the high-end production was a massive number of injuries to Eagles' wide receivers and that shows up in Goedert's splits. The 2018 second-round pick posted five top-10 fantasy weeks, but four came after the team's Week 10 bye. Goedert appears to have a bright future, but the 25-year-old will struggle for TE1 numbers barring an Ertz injury. Goedert is, however, one of the best insurance policies in fantasy.",
    "otherLeagueDraftValue": 0.07
  },
  {
    "name": "Austin Hooper",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 105.0,
    "average": 8.076923076923077,
    "bio": "Hooper signed with the Browns during the offseason following four seasons with the Falcons. The 2016 third-round pick has finished no lower than seventh among tight ends in routes, targets, receptions or receiving yards each of the past two seasons. He posted career-high marks in targets (96), receptions (75), receiving yards (787) and touchdowns (six) last season despite missing three games and was fantasy's top-scoring tight end prior to suffering an injury in Week 10. Hooper's stock takes hit as he trades Matt Ryan and Atlanta's pass-heavy offense for Baker Mayfield and a Browns offense that also include David Njoku. Hooper enters his age-25 season as a borderline top-10 fantasy option.",
    "otherLeagueDraftValue": 0.79
  },
  {
    "name": "Irv Smith Jr.",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 90.0,
    "average": 6.923076923076923,
    "bio": "Smith is entering his second NFL season after posting a 36-311-2 receiving line as a rookie. The 2019 second-round pick played a healthy 587 snaps, but was a clear second to Kyle Rudolph (749 snaps) on the depth chart and was primarily utilized as short-area target (5.9 aDOT). Rudolph out-targeted Smith 49 to 48, though Smith is a strong bet to take over as the team's top receiving threat at the position in his second season. Smith is still extremely young (he's entering his age-22 season), but especially with Stefon Diggs gone, he's well-positioned for a step forward. Rudolph's presence will limit his ceiling, but Smith is a fine TE2 target.",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Dan Arnold",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 90.0,
    "average": 5.625,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Gerald Everett",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 85.0,
    "average": 5.3125,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Anthony Firkser",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 81.0,
    "average": 5.0625,
    "bio": "",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Mo Alie-Cox",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 79.0,
    "average": 5.266666666666667,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Jordan Akins",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 76.0,
    "average": 5.846153846153846,
    "bio": "",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Tyler Eifert",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 75.0,
    "average": 5.0,
    "bio": "Eifert signed with the Jaguars during the offseason after seven seasons with the Bengals. The 2013 first-round pick held up for 16 games last season for the first time in his career, but a situational role limited him to 44% of the snaps and 4.0 targets per game. Eifert finished TE19 in fantasy, which marked his first top-20 campaign since 2015. New Jaguars OC Jay Gruden makes heavy use of his tight ends (career 23% target share), which benefits Eifert and second-year TE Josh Oliver. Of course, we still need to be wary of Eifert's durability after he missed 52 of 80 possible games during the 2014-18 seasons. Eifert is a fringe TE2 at best.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Trey Burton",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 74.0,
    "average": 5.6923076923076925,
    "bio": "",
    "otherLeagueDraftValue": 0.03
  },
  {
    "name": "Drew Sample",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 72.0,
    "average": 4.5,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Zach Ertz",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 71.0,
    "average": 6.454545454545454,
    "bio": "Ertz had his hands full playing through injuries and double coverage last season, but the veteran tight end still managed his third consecutive campaign as a top-four fantasy tight end. Ertz hasn't finished lower than fifth in targets, sixth in receptions or seventh in yardage at the position since 2014. He's also ranked no lower than fourth in touchdowns and OTD each of the past three seasons. Third-year Dallas Goedert is looming, but Ertz enters his age-29 season as Carson Wentz's top target and remains a top-five fantasy tight end.",
    "otherLeagueDraftValue": 0.11
  },
  {
    "name": "Chris Herndon",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 68.0,
    "average": 4.25,
    "bio": "Herndon is back on the fantasy radar following an injury-plagued 2019 campaign in which he was limited to 16 snaps. The Jets selected Herndon in the fourth round of the 2018 draft and quickly put him in position for a big role. The Miami product was on the field for 63% of New York's snaps and, following a slow start, was fantasy's No. 9 tight end from Week 6 on. His 10.3 aDOT was fifth-highest at the position and helped him to a strong 9.0 YPT (10th). Herndon's 502 receiving yards rank 12th, his catch rate 12th, his YPT fourth and his aDOT second among rookie tight ends since 2007. Herndon is an excellent post-hype target and positioned well for a breakout.",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Darren Fells",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 68.0,
    "average": 4.25,
    "bio": "Fells re-signed with Houston during the offseason after producing the elusive 'age-33 breakout season' in 2019. Fells found the end zone seven times, which was third-most at the position. Fells was on the field often (his 704 snaps ranked 12th), but wasn't targeted much (46 targets) and benefited from unsustainable fortune in the touchdown department (3.7 OTD, six end zone targets). Fells also did a lot of his damage early on, as he delivered four top-10 fantasy weeks through Week 8, but none better than 15th from that point on. He remains well off the fantasy radar, especially with Jordan Thomas, Kahale Warring and Jordan Akins looming.",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Jordan Reed",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 66.0,
    "average": 6.6,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Richard Rodgers",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 65.0,
    "average": 4.642857142857143,
    "bio": "",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Kyle Rudolph",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 61.0,
    "average": 5.083333333333333,
    "bio": "Minnesota placed Rudolph on the trade block last offseason, but the situation was resolved with a contract extension and the veteran tight end finishing eighth among tight ends in snaps and fourth in touchdowns (six). Of course, sharing with Irv Smith Jr. in a run-heavy offense also had its disadvantages. Rudolph's catch (39) and yardage (367) totals were both his lowest since 2014. Rudolph remains a reliable short-area target, but he's now 30 years old and figures to lose more looks to Smith in 2020. Rudolph is no more than a fringe TE2.",
    "otherLeagueDraftValue": 0.11
  },
  {
    "name": "Cameron Brate",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 61.0,
    "average": 3.8125,
    "bio": "Brate might be on the TE1 radar on other rosters, but the long-time situational target continues to trend in the wrong direction in Tampa Bay. Brate posted a pair of top-10 fantasy campaigns during the 2016-17 seasons, but fell to 19th in 2018 and 24th last season. Brate has been very touchdown-reliant, having ranked no lower than eighth at the position in TD rate each of the past five seasons. Brate's 269 routes last season were his fewest since 2015 and he's unlikely to rebound with TE-unfriendly coach Bruce Arians and O.J. Howard and Rob Gronkowski in the fold. Brate is well off the fantasy radar.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Dawson Knox",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 60.0,
    "average": 5.0,
    "bio": "The Bills selected Knox in the third round of the 2019 draft and the Ole Miss product quickly earned his way to a significant offensive role. Knox played 64% of the offensive snaps and produced a 28-388-2 receiving line on 50 targets prior to resting in Week 17. The combination of plenty of downfield routes (his 9.2 aDOT ranked sixth) and Josh Allen's inaccuracy (20% off-target rate ranked ninth) led to an ugly 56% catch rate (second-worst), but Knox still managed a respectable 7.8 YPT (14th-best). The 23-year-old is an obvious candidate for a step forward in his second season, but with Stefon Diggs added to Buffalo's run-heavy offense, Knox is a borderline TE2 at best.",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Jacob Hollister",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 58.0,
    "average": 3.625,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Cole Kmet",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 57.0,
    "average": 3.5625,
    "bio": "The Bears selected Kmet with the 43rd pick of April's draft. The Notre Dame product is a solid receiver and capable blocker who also happens to be one of the youngest tight ends in this year's rookie class (he turned 21 in March). He has outstanding size (6-foot-6, 262 pounds), as well as good hands and balls skills. He has drawn Austin Hooper and Tyler Higbee comparisons as a player who figures to develop into a pass-catching in-line tight end. Like most (OK, all) young tight ends, it will take Kmet some time to reach TE1 territory, but he'll be a strong dynasty stash. Kmet has almost zero 2020 value behind Jimmy Graham.",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Jack Doyle",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 57.0,
    "average": 4.071428571428571,
    "bio": "With Eric Ebron out of the picture, Doyle has regained his status as the Colts' clear top tight end. We got a glimpse of what that could look like late last season as Doyle tied for the team lead with 31 targets (20% share) once Ebron went on IR after Week 12. Doyle was held to two top-10 fantasy weeks and one finish better than eighth on the season, but there are reasons for optimism. Coach Frank Reich's tight end units have never combined for a target share below 23% in six seasons as a coach/OC. Also, new QB Philip Rivers made heavy usage of Antonio Gates and Hunter Henry in recent years with the Chargers. Doyle, who ranked sixth at tight end with eight end zone targets last season, should be viewed as a fringe top-15 fantasy TE in his age-30 season.",
    "otherLeagueDraftValue": 0.02
  },
  {
    "name": "Harrison Bryant",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 55.0,
    "average": 3.6666666666666665,
    "bio": "The Browns selected Bryant in the fourth round of April's draft. Bryant's numbers were off the charts at Florida Atlantic last season, as he averaged a class-best 3.1 yards per route run while posting a 65-1,004-7 receiving line on 99 targets. Bryant is a terrific receiver, and that figures to be his primary focus in the pros, but he's not a zero as a blocker, which could lead to the coveted every-down role. Bryant's hands are a slight concern, and he didn't show well athletically at the combine, but his receiving prowess makes him an intriguing prospect. He won't be fantasy relevant for a long time with Austin Hooper and David Njoku ahead of him in Cleveland.",
    "otherLeagueDraftValue": 0.01
  },
  {
    "name": "Will Dissly",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 51.0,
    "average": 3.1875,
    "bio": "Dissly is entering his third NFL season having managed only eight full games due to injury. The 2018 fourth-round pick has been very productive, producing at least 13 fantasy points in six of those eight games, but the injuries have obviously derailed his career to this point. The 24-year-old is recovering from a torn Achilles and it's very possible he won't be ready for Week 1. Seattle signed Greg Olsen during the offseason, so Dissly may struggle for consistent fantasy production at least until late in the 2020 season. He should not be drafted unless cleared earlier than expected.",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Greg Olsen",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 50.0,
    "average": 4.545454545454546,
    "bio": "Olsen signed with the Seahawks during the offseason following 13 seasons with the Bears and Panthers. The veteran tight end missed roughly half of both the 2017 and 2018 seasons before getting back on track in 2019. Despite missing two more games, Olsen finished sixth at the position in routes and 11th in targets, receptions, yardage and OTD. He was TE13 in fantasy, though it could've been better if not for bad touchdown luck (2 TD, 4.7 OTD). Olsen is now 35 and, while his move to Seattle could allow early-season fantasy relevance, it is expected that Will Dissly will return to the lineup at some point this calendar year. Olsen is only worth a late pick in deeper leagues.",
    "otherLeagueDraftValue": 0.24
  },
  {
    "name": "Durham Smythe",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 50.0,
    "average": 3.3333333333333335,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "James O'Shaughnessy",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 49.0,
    "average": 3.2666666666666666,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "David Njoku",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 46.0,
    "average": 3.5384615384615383,
    "bio": "Njoku was expected to emerge after Cleveland selected him in the first round of the 2017 draft. He appears to be on track after posting a 56-639-4 receiving line (TE9 in fantasy) in 2018, but injuries and a demotion courtesy of Freddie Kitchens led to a grand total of 10 targets in four games last season. It's possible tight end-friendly new head coach Kevin Stefanski can get Njoku's career back on track, but Cleveland's heavy investment in Austin Hooper is crushing for Njoku's fantasy upside. The 24-year-old is a long shot for anything more than a situational role and not worth drafting in most formats.",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Ross Dwelley",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 44.0,
    "average": 2.75,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Tyler Conklin",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 42.0,
    "average": 2.625,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  },
  {
    "name": "Donald Parham Jr.",
    "position": "TE",
    "auctionPrice": 0,
    "totalPoints": 38.0,
    "average": 2.923076923076923,
    "bio": "",
    "otherLeagueDraftValue": 0.0
  }
]
